app/views/companies/progress.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."company_id" = ?  [["company_id", 16]]
---
  <ul class="progress-list">
  <% @company.comments.each do |c| %>