crm/app/views/uploader/index.html.erb

     <tbody>
          <% UploadFile.all.reverse_order.each do |upload| %>
---
SELECT "upload_files".* FROM "upload_files" ORDER BY "upload_files"."id" DESC