crm/app/views/companies/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."company_id" = ? ORDER BY "comments"."id" DESC  [["company_id", 305]]
---
<table width="90%">
<% if @company.comments.any? %>