crm/app/controllers/comments_controller.rb

 def create
    @company = Company.find(params[:company_id])
    @company.comments.create(comment_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 213], ["LIMIT", 1]]
INSERT INTO "comments" ("carriaup_progress", "carriaup_start", "carriaup_each_name", "carriaup_each_limited_start", "carriaup_each_regular", "carriaup_each_supply", "carriaup_comment", "company_id", "created_at", "updated_at", "status_cd") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
      @company = Company.find(params[:company_id])
      @comment = @company.comments.find(params[:id])
     if @comment.update(comment_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 213], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."company_id" = ? AND "comments"."id" = ? LIMIT ?  [["company_id", 213], ["id", 1707], ["LIMIT", 1]]
UPDATE "comments" SET "system_progress" = ?, "system_start" = ?, "system_implementation" = ?, "system_supply" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["system_progress", "6.制度未実施"], ["system_start", ""], ["system_implementation", ""], ["system_supply", ""], ["updated_at", "2018-10-12 16:28:58.558375"], ["id", 679]]

  def view
    @comment = Comment.find(params[:id].to_i)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 267], ["LIMIT", 1]]

  def bulk_destroy
    return unless params[:ids]
    companies = Comment.where(id: params[:ids])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" IN (1546, 1570)