crm/app/controllers/companies_controller.rb

  def index
     @type = params[:type]
  	 @q = Company.ransack(params[:q])
  	 @companies = @q.result.page(params[:page]).per(100)
     case @type
     when "carrier" then
       @comments = Comment
        .where(company: @companies)
        .where.not(carriaup_progress: nil)
        .page(params[:page]).per(100)
    when "limited" then
      @comments = Comment
       .where(company: @companies)
       .where.not(limited_progress: nil)
       .page(params[:page]).per(100)
     when "system" then
       @comments = Comment
        .where(company: @companies)
        .where(system_each_name: Comment::SYSTEM_NAMES[params[:i].to_i])
        .page(params[:page]).per(100)
     else
       @comments = Comment.where(company: @companies).page(params[:page]).per(100)
---
SELECT  "companies".* FROM "companies" WHERE ("companies"."company" LIKE '%ライズ%') LIMIT ? OFFSET ?  [["LIMIT", 100], ["OFFSET", 0]]
SELECT COUNT(*) FROM "companies"
SELECT  "comments".* FROM "comments" WHERE "comments"."company_id" IN (SELECT  "companies"."id" FROM "companies" LIMIT ? OFFSET ?) AND "comments"."system_each_name" = ? LIMIT ? OFFSET ?  [["LIMIT", 100], ["OFFSET", 0], ["system_each_name", "（企）職業能力評価制度"], ["LIMIT", 100], ["OFFSET", 0]]
SELECT  "comments".* FROM "comments" WHERE "comments"."company_id" IN (SELECT  "companies"."id" FROM "companies" LIMIT ? OFFSET ?) AND ("comments"."carriaup_progress" IS NOT NULL) LIMIT ? OFFSET ?  [["LIMIT", 100], ["OFFSET", 0], ["LIMIT", 100], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."company_id" IN (SELECT  "companies"."id" FROM "companies" LIMIT ? OFFSET ?)  [["LIMIT", 100], ["OFFSET", 0]]

  def progress
  	@company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

 def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("company", "first_name", "last_name", "tel", "fax", "e_mail", "postnumber", "prefecture", "city", "town", "caption", "labor_number", "employment_number", "trial_period", "work_start", "break_in", "break_out", "work_out", "holiday", "allowance", "allowance_contents", "closing_on", "payment_on", "method_payment", "desuction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

 def update
    @company = Company.find(params[:id])
    if !@company.update(company_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 309], ["LIMIT", 1]]
UPDATE "companies" SET "company" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["company", "aaa"], ["updated_at", "2018-10-27 02:06:26.554320"], ["id", 310]]

 def bulk_destroy
   return unless params[:ids]
   companies = Company.where(id: params[:ids])
   count = Company.all.count
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" IN (16, 17)
SELECT COUNT(*) FROM "companies"