crm/app/controllers/faqs_controller.rb

  def index
  	 @faqs = Faq.all.order(created_at: 'desc')
---
SELECT "faqs".* FROM "faqs" ORDER BY "faqs"."created_at" DESC