crm/app/controllers/invoices_controller.rb

  def index
  	 @invoices = Invoice.all.order(created_at: 'desc')
---
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC

  def show
  	@invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]