crm/app/controllers/todos_controller.rb

  def index
     if params[:selected]
       @selected = params[:selected]
       @todos = Todo.where(select: @selected).order(created_at: 'desc')
       @todo = Todo.new(select: @selected)
     else
        @todos = Todo.all.order(created_at: 'desc')
---
SELECT "todos".* FROM "todos" WHERE "todos"."select" = ? ORDER BY "todos"."created_at" DESC  [["select", "井上社会保険労務士"]]
SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC

 def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "select", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "アロハ"], ["select", "事務"], ["created_at", "2018-10-28 05:23:17.063557"], ["updated_at", "2018-10-28 05:23:17.063557"]]

 def update
    @todo = Todo.find(params[:id])
    @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "deadline" = ?, "state" = ?, "name" = ?, "contents" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "アロハ2"], ["deadline", ""], ["state", ""], ["name", ""], ["contents", ""], ["updated_at", "2018-10-28 05:47:05.957401"], ["id", 4]]