crm/app/controllers/uploader_controller.rb

  def download
    @upload_file = UploadFile.find(params[:id].to_i)
---
SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def view
    @upload_file = UploadFile.find(params[:id].to_i)
---
SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def edit
    @upload_file = UploadFile.find(params[:id])
---
SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

 def update
    @upload_file = UploadFile.find(params[:id])
     if @upload_file.update(upload_file_params)
---
SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "upload_files" SET "name" = ?, "updated_at" = ? WHERE "upload_files"."id" = ?  [["name", "sss"], ["updated_at", "2018-10-27 09:27:41.993284"], ["id", 10]]

  def destroy
     @upload_file = UploadFile.find(params[:id])
     filepath = @upload_file.file.current_path
     #remove filepath?
     @upload_file.destroy
---
SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "upload_files" WHERE "upload_files"."id" = ?  [["id", 1]]