app/controllers/prefectures_controller.rb

SELECT "prefectures".* FROM "prefectures" ORDER BY "prefectures"."created_at" DESC
---
	def index
		@prefectures = Prefecture.all.order(created_at: 'desc')