#!/usr/bin/env python
# coding: utf-8

# In[6]:


from selenium.webdriver.common.by import By
from selenium.webdriver.support.ui import Select
import re
import os
import time
from selenium import webdriver
from bs4 import BeautifulSoup
from difflib import SequenceMatcher
from PIL import Image
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
import subprocess
gl_Money=''
gl_president=''
gl_empNum=''
gl_address=''
gl_business=''
gl_tel=''
gl_buyFlg=''
gl_HP=''
gl_Com=''
driver=''
gl_HPsource=''
gl_askEmail=''
gl_askPage=''
gl_comName=''
import pandas as pd
sugAddChk = ['北海道','青森県','岩手県','宮城県','秋田県','山形県','福島県','茨城県','栃木県','群馬県','埼玉県','千葉県','東京都','神奈川県','新潟県','富山県','石川県','福井県','山梨県','長野県','岐阜県','静岡県','愛知県','三重県','滋賀県','京都府','大阪府','兵庫県','奈良県','和歌山県','鳥取県','島根県','岡山県','広島県','山口県','徳島県','香川県','愛媛県','高知県','福岡県','佐賀県','長崎県','熊本県','大分県','宮崎県','鹿児島県','⿅児島県','沖縄県']
sugSubAddChk =['ﾎｯｶｲﾄﾞｳ','札幌市','函館市','小樽市','旭川市','室蘭市','釧路市','帯広市','北見市','夕張市','岩見沢市','網走市','留萌市','苫小牧市','稚内市','美唄市','芦別市','江別市','赤平市','紋別市','士別市','名寄市','三笠市','根室市','千歳市','滝川市','砂川市','歌志内市','深川市','富良野市','登別市','恵庭市','伊達市','北広島市','石狩市','北斗市','当別町','新篠津村','松前町','福島町','知内町','木古内町','七飯町','鹿部町','森町','八雲町','長万部町','江差町','上ノ国町','厚沢部町','乙部町','奥尻町','今金町','せたな町','島牧村','寿都町','黒松内町','蘭越町','ニセコ町','真狩村','留寿都村','喜茂別町','京極町','倶知安町','共和町','岩内町','泊村','神恵内村','積丹町','古平町','仁木町','余市町','赤井川村','南幌町','奈井江町','上砂川町','由仁町','長沼町','栗山町','月形町','浦臼町','新十津川町','妹背牛町','秩父別町','雨竜町','北竜町','沼田町','鷹栖町','東神楽町','当麻町','比布町','愛別町','上川町','東川町','美瑛町','上富良野町','中富良野町','南富良野町','占冠村','和寒町','剣淵町','下川町','美深町','音威子府村','中川町','幌加内町','増毛町','小平町','苫前町','羽幌町','初山別村','遠別町','天塩町','猿払村','浜頓別町','中頓別町','枝幸町','豊富町','礼文町','利尻町','利尻富士町','幌延町','美幌町','津別町','斜里町','清里町','小清水町','訓子府町','置戸町','佐呂間町','遠軽町','湧別町','滝上町','興部町','西興部村','雄武町','大空町','豊浦町','壮瞥町','白老町','厚真町','洞爺湖町','安平町','むかわ町','日高町','平取町','新冠町','浦河町','様似町','えりも町','新ひだか町','音更町','士幌町','上士幌町','鹿追町','新得町','清水町','芽室町','中札内村','更別村','大樹町','広尾町','幕別町','池田町','豊頃町','本別町','足寄町','陸別町','浦幌町','釧路町','厚岸町','浜中町','標茶町','弟子屈町','鶴居村','白糠町','別海町','中標津町','標津町','羅臼町','色丹村','留夜別村','留別村','紗那村','蘂取村','ｱｵﾓﾘｹﾝ','青森市','弘前市','八戸市','黒石市','五所川原市','十和田市','三沢市','むつ市','つがる市','平川市','平内町','今別町','蓬田村','外ヶ浜町','鰺ヶ沢町','深浦町','西目屋村','藤崎町','大鰐町','田舎館村','板柳町','鶴田町','中泊町','野辺地町','七戸町','六戸町','横浜町','東北町','六ヶ所村','おいらせ町','大間町','東通村','風間浦村','佐井村','三戸町','五戸町','田子町','南部町','階上町','新郷村','ｲﾜﾃｹﾝ','盛岡市','宮古市','大船渡市','花巻市','北上市','久慈市','遠野市','一関市','陸前高田市','釜石市','二戸市','八幡平市','奥州市','滝沢市','雫石町','葛巻町','岩手町','紫波町','矢巾町','西和賀町','金ケ崎町','平泉町','住田町','大槌町','山田町','岩泉町','田野畑村','普代村','軽米町','野田村','九戸村','洋野町','一戸町','ﾐﾔｷﾞｹﾝ','仙台市','石巻市','塩竈市','気仙沼市','白石市','名取市','角田市','多賀城市','岩沼市','登米市','栗原市','東松島市','大崎市','富谷市','蔵王町','七ヶ宿町','大河原町','村田町','柴田町','川崎町','丸森町','亘理町','山元町','松島町','七ヶ浜町','利府町','大和町','大郷町','大衡村','色麻町','加美町','涌谷町','美里町','女川町','南三陸町','ｱｷﾀｹﾝ','秋田市','能代市','横手市','大館市','男鹿市','湯沢市','鹿角市','由利本荘市','潟上市','大仙市','北秋田市','にかほ市','仙北市','小坂町','上小阿仁村','藤里町','三種町','八峰町','五城目町','八郎潟町','井川町','大潟村','美郷町','羽後町','東成瀬村','ﾔﾏｶﾞﾀｹﾝ','山形市','米沢市','鶴岡市','酒田市','新庄市','寒河江市','上山市','村山市','長井市','天童市','東根市','尾花沢市','南陽市','山辺町','中山町','河北町','西川町','朝日町','大江町','大石田町','金山町','最上町','舟形町','真室川町','大蔵村','鮭川村','戸沢村','高畠町','川西町','小国町','白鷹町','飯豊町','三川町','庄内町','遊佐町','ﾌｸｼﾏｹﾝ','福島市','会津若松市','郡山市','いわき市','白河市','須賀川市','喜多方市','相馬市','二本松市','田村市','南相馬市','本宮市','桑折町','国見町','川俣町','大玉村','鏡石町','天栄村','下郷町','檜枝岐村','只見町','南会津町','北塩原村','西会津町','磐梯町','猪苗代町','会津坂下町','湯川村','柳津町','三島町','昭和村','会津美里町','西郷村','泉崎村','中島村','矢吹町','棚倉町','矢祭町','塙町','鮫川村','石川町','玉川村','平田村','浅川町','古殿町','三春町','小野町','広野町','楢葉町','富岡町','川内村','大熊町','双葉町','浪江町','葛尾村','新地町','飯舘村','ｲﾊﾞﾗｷｹﾝ','水戸市','日立市','土浦市','古河市','石岡市','結城市','龍ケ崎市','下妻市','常総市','常陸太田市','高萩市','北茨城市','笠間市','取手市','牛久市','つくば市','ひたちなか市','鹿嶋市','潮来市','守谷市','常陸大宮市','那珂市','筑西市','坂東市','稲敷市','かすみがうら市','桜川市','神栖市','行方市','鉾田市','つくばみらい市','小美玉市','茨城町','大洗町','城里町','東海村','大子町','美浦村','阿見町','河内町','八千代町','五霞町','境町','利根町','ﾄﾁｷﾞｹﾝ','宇都宮市','足利市','栃木市','佐野市','鹿沼市','日光市','小山市','真岡市','大田原市','矢板市','那須塩原市','さくら市','那須烏山市','下野市','上三川町','益子町','茂木町','市貝町','芳賀町','壬生町','野木町','塩谷町','高根沢町','那須町','那珂川町','ｸﾞﾝﾏｹﾝ','前橋市','高崎市','桐生市','伊勢崎市','太田市','沼田市','館林市','渋川市','藤岡市','富岡市','安中市','みどり市','榛東村','吉岡町','上野村','神流町','下仁田町','南牧村','甘楽町','中之条町','長野原町','嬬恋村','草津町','高山村','東吾妻町','片品村','川場村','みなかみ町','玉村町','板倉町','明和町','千代田町','大泉町','邑楽町','ｻｲﾀﾏｹﾝ','さいたま市','川越市','熊谷市','川口市','行田市','秩父市','所沢市','飯能市','加須市','本庄市','東松山市','春日部市','狭山市','羽生市','鴻巣市','深谷市','上尾市','草加市','越谷市','蕨市','戸田市','入間市','朝霞市','志木市','和光市','新座市','桶川市','久喜市','北本市','八潮市','富士見市','三郷市','蓮田市','坂戸市','幸手市','鶴ヶ島市','日高市','吉川市','ふじみ野市','白岡市','伊奈町','三芳町','毛呂山町','越生町','滑川町','嵐山町','小川町','川島町','吉見町','鳩山町','ときがわ町','横瀬町','皆野町','長瀞町','小鹿野町','東秩父村','神川町','上里町','寄居町','宮代町','杉戸町','松伏町','ﾁﾊﾞｹﾝ','千葉市','銚子市','市川市','船橋市','館山市','木更津市','松戸市','野田市','茂原市','成田市','佐倉市','東金市','旭市','習志野市','柏市','勝浦市','市原市','流山市','八千代市','我孫子市','鴨川市','鎌ケ谷市','君津市','富津市','浦安市','四街道市','袖ケ浦市','八街市','印西市','白井市','富里市','南房総市','匝瑳市','香取市','山武市','いすみ市','大網白里市','酒々井町','栄町','神崎町','多古町','東庄町','九十九里町','芝山町','横芝光町','一宮町','睦沢町','長生村','白子町','長柄町','長南町','大多喜町','御宿町','鋸南町','ﾄｳｷｮｳﾄ','千代田区','中央区','港区','新宿区','文京区','台東区','墨田区','江東区','品川区','目黒区','大田区','世田谷区','渋谷区','中野区','杉並区','豊島区','北区','荒川区','板橋区','練馬区','足立区','葛飾区','江戸川区','八王子市','立川市','武蔵野市','三鷹市','青梅市','府中市','昭島市','調布市','町田市','小金井市','小平市','日野市','東村山市','国分寺市','国立市','福生市','狛江市','東大和市','清瀬市','東久留米市','武蔵村山市','多摩市','稲城市','羽村市','あきる野市','西東京市','瑞穂町','日の出町','檜原村','奥多摩町','大島町','利島村','新島村','神津島村','三宅村','御蔵島村','八丈町','青ヶ島村','小笠原村','ｶﾅｶﾞﾜｹﾝ','横浜市','川崎市','相模原市','横須賀市','平塚市','鎌倉市','藤沢市','小田原市','茅ヶ崎市','逗子市','三浦市','秦野市','厚木市','大和市','伊勢原市','海老名市','座間市','南足柄市','綾瀬市','葉山町','寒川町','大磯町','二宮町','中井町','大井町','松田町','山北町','開成町','箱根町','真鶴町','湯河原町','愛川町','清川村','ﾆｲｶﾞﾀｹﾝ','新潟市','長岡市','三条市','柏崎市','新発田市','小千谷市','加茂市','十日町市','見附市','村上市','燕市','糸魚川市','妙高市','五泉市','上越市','阿賀野市','佐渡市','魚沼市','南魚沼市','胎内市','聖籠町','弥彦村','田上町','阿賀町','出雲崎町','湯沢町','津南町','刈羽村','関川村','粟島浦村','ﾄﾔﾏｹﾝ','富山市','高岡市','魚津市','氷見市','滑川市','黒部市','砺波市','小矢部市','南砺市','射水市','舟橋村','上市町','立山町','入善町','ｲｼｶﾜｹﾝ','金沢市','七尾市','小松市','輪島市','珠洲市','加賀市','羽咋市','かほく市','白山市','能美市','野々市市','川北町','津幡町','内灘町','志賀町','宝達志水町','中能登町','穴水町','能登町','ﾌｸｲｹﾝ','福井市','敦賀市','小浜市','大野市','勝山市','鯖江市','あわら市','越前市','坂井市','永平寺町','南越前町','越前町','美浜町','高浜町','おおい町','若狭町','ﾔﾏﾅｼｹﾝ','甲府市','富士吉田市','都留市','山梨市','大月市','韮崎市','南アルプス市','北杜市','甲斐市','笛吹市','上野原市','甲州市','中央市','市川三郷町','早川町','身延町','富士川町','昭和町','道志村','西桂町','忍野村','山中湖村','鳴沢村','富士河口湖町','小菅村','丹波山村','ﾅｶﾞﾉｹﾝ','長野市','松本市','上田市','岡谷市','飯田市','諏訪市','須坂市','小諸市','伊那市','駒ヶ根市','中野市','大町市','飯山市','茅野市','塩尻市','佐久市','千曲市','東御市','安曇野市','小海町','川上村','南相木村','北相木村','佐久穂町','軽井沢町','御代田町','立科町','青木村','長和町','下諏訪町','富士見町','原村','辰野町','箕輪町','飯島町','南箕輪村','中川村','宮田村','松川町','高森町','阿南町','阿智村','平谷村','根羽村','下條村','売木村','天龍村','泰阜村','喬木村','豊丘村','大鹿村','上松町','南木曽町','木祖村','王滝村','大桑村','木曽町','麻績村','生坂村','山形村','朝日村','筑北村','松川村','白馬村','小谷村','坂城町','小布施町','山ノ内町','木島平村','野沢温泉村','信濃町','小川村','飯綱町','栄村','ｷﾞﾌｹﾝ','岐阜市','大垣市','高山市','多治見市','関市','中津川市','美濃市','瑞浪市','羽島市','恵那市','美濃加茂市','土岐市','各務原市','可児市','山県市','瑞穂市','飛騨市','本巣市','郡上市','下呂市','海津市','岐南町','笠松町','養老町','垂井町','関ケ原町','神戸町','輪之内町','安八町','揖斐川町','大野町','北方町','坂祝町','富加町','川辺町','七宗町','八百津町','白川町','東白川村','御嵩町','白川村','ｼｽﾞｵｶｹﾝ','静岡市','浜松市','沼津市','熱海市','三島市','富士宮市','伊東市','島田市','富士市','磐田市','焼津市','掛川市','藤枝市','御殿場市','袋井市','下田市','裾野市','湖西市','伊豆市','御前崎市','菊川市','伊豆の国市','牧之原市','東伊豆町','河津町','南伊豆町','松崎町','西伊豆町','函南町','長泉町','小山町','吉田町','川根本町','ｱｲﾁｹﾝ','名古屋市','豊橋市','岡崎市','一宮市','瀬戸市','半田市','春日井市','豊川市','津島市','碧南市','刈谷市','豊田市','安城市','西尾市','蒲郡市','犬山市','常滑市','江南市','小牧市','稲沢市','新城市','東海市','大府市','知多市','知立市','尾張旭市','高浜市','岩倉市','豊明市','日進市','田原市','愛西市','清須市','北名古屋市','弥富市','みよし市','あま市','長久手市','東郷町','豊山町','大口町','扶桑町','大治町','蟹江町','飛島村','阿久比町','東浦町','南知多町','武豊町','幸田町','設楽町','東栄町','豊根村','ﾐｴｹﾝ','津市','四日市市','伊勢市','松阪市','桑名市','鈴鹿市','名張市','尾鷲市','亀山市','鳥羽市','熊野市','いなべ市','志摩市','伊賀市','木曽岬町','東員町','菰野町','川越町','多気町','大台町','玉城町','度会町','大紀町','南伊勢町','紀北町','御浜町','紀宝町','ｼｶﾞｹﾝ','大津市','彦根市','長浜市','近江八幡市','草津市','守山市','栗東市','甲賀市','野洲市','湖南市','高島市','東近江市','米原市','日野町','竜王町','愛荘町','豊郷町','甲良町','多賀町','ｷｮｳﾄﾌ','京都市','福知山市','舞鶴市','綾部市','宇治市','宮津市','亀岡市','城陽市','向日市','長岡京市','八幡市','京田辺市','京丹後市','南丹市','木津川市','大山崎町','久御山町','井手町','宇治田原町','笠置町','和束町','精華町','南山城村','京丹波町','伊根町','与謝野町','ｵｵｻｶﾌ','大阪市','堺市','岸和田市','豊中市','池田市','吹田市','泉大津市','高槻市','貝塚市','守口市','枚方市','茨木市','八尾市','泉佐野市','富田林市','寝屋川市','河内長野市','松原市','大東市','和泉市','箕面市','柏原市','羽曳野市','門真市','摂津市','高石市','藤井寺市','東大阪市','泉南市','四條畷市','交野市','大阪狭山市','阪南市','島本町','豊能町','能勢町','忠岡町','熊取町','田尻町','岬町','太子町','河南町','千早赤阪村','ﾋｮｳｺﾞｹﾝ','神戸市','姫路市','尼崎市','明石市','西宮市','洲本市','芦屋市','伊丹市','相生市','豊岡市','加古川市','赤穂市','西脇市','宝塚市','三木市','高砂市','川西市','小野市','三田市','加西市','丹波篠山市','養父市','丹波市','南あわじ市','朝来市','淡路市','宍粟市','加東市','たつの市','猪名川町','多可町','稲美町','播磨町','市川町','福崎町','神河町','上郡町','佐用町','香美町','新温泉町','ﾅﾗｹﾝ','奈良市','大和高田市','大和郡山市','天理市','橿原市','桜井市','五條市','御所市','生駒市','香芝市','葛城市','宇陀市','山添村','平群町','三郷町','斑鳩町','安堵町','三宅町','田原本町','曽爾村','御杖村','高取町','明日香村','上牧町','王寺町','広陵町','河合町','吉野町','大淀町','下市町','黒滝村','天川村','野迫川村','十津川村','下北山村','上北山村','東吉野村','ﾜｶﾔﾏｹﾝ','和歌山市','海南市','橋本市','有田市','御坊市','田辺市','新宮市','紀の川市','岩出市','紀美野町','かつらぎ町','九度山町','高野町','湯浅町','広川町','有田川町','由良町','印南町','みなべ町','日高川町','白浜町','上富田町','すさみ町','那智勝浦町','太地町','古座川町','北山村','串本町','ﾄｯﾄﾘｹﾝ','鳥取市','米子市','倉吉市','境港市','岩美町','若桜町','智頭町','八頭町','三朝町','湯梨浜町','琴浦町','北栄町','日吉津村','大山町','伯耆町','日南町','江府町','ｼﾏﾈｹﾝ','松江市','浜田市','出雲市','益田市','大田市','安来市','江津市','雲南市','奥出雲町','飯南町','川本町','邑南町','津和野町','吉賀町','海士町','西ノ島町','知夫村','隠岐の島町','ｵｶﾔﾏｹﾝ','岡山市','倉敷市','津山市','玉野市','笠岡市','井原市','総社市','高梁市','新見市','備前市','瀬戸内市','赤磐市','真庭市','美作市','浅口市','和気町','早島町','里庄町','矢掛町','新庄村','鏡野町','勝央町','奈義町','西粟倉村','久米南町','美咲町','吉備中央町','ﾋﾛｼﾏｹﾝ','広島市','呉市','竹原市','三原市','尾道市','福山市','三次市','庄原市','大竹市','東広島市','廿日市市','安芸高田市','江田島市','府中町','海田町','熊野町','坂町','安芸太田町','北広島町','大崎上島町','世羅町','神石高原町','ﾔﾏｸﾞﾁｹﾝ','下関市','宇部市','山口市','萩市','防府市','下松市','岩国市','光市','長門市','柳井市','美祢市','周南市','山陽小野田市','周防大島町','和木町','上関町','田布施町','平生町','阿武町','ﾄｸｼﾏｹﾝ','徳島市','鳴門市','小松島市','阿南市','吉野川市','阿波市','美馬市','三好市','勝浦町','上勝町','佐那河内村','石井町','神山町','那賀町','牟岐町','美波町','海陽町','松茂町','北島町','藍住町','板野町','上板町','つるぎ町','東みよし町','ｶｶﾞﾜｹﾝ','高松市','丸亀市','坂出市','善通寺市','観音寺市','さぬき市','東かがわ市','三豊市','土庄町','小豆島町','三木町','直島町','宇多津町','綾川町','琴平町','多度津町','まんのう町','ｴﾋﾒｹﾝ','松山市','今治市','宇和島市','八幡浜市','新居浜市','西条市','大洲市','伊予市','四国中央市','西予市','東温市','上島町','久万高原町','砥部町','内子町','伊方町','松野町','鬼北町','愛南町','ｺｳﾁｹﾝ','高知市','室戸市','安芸市','南国市','土佐市','須崎市','宿毛市','土佐清水市','四万十市','香南市','香美市','東洋町','奈半利町','田野町','安田町','北川村','馬路村','芸西村','本山町','大豊町','土佐町','大川村','いの町','仁淀川町','中土佐町','佐川町','越知町','梼原町','日高村','津野町','四万十町','大月町','三原村','黒潮町','ﾌｸｵｶｹﾝ','北九州市','福岡市','大牟田市','久留米市','直方市','飯塚市','田川市','柳川市','八女市','筑後市','大川市','行橋市','豊前市','中間市','小郡市','筑紫野市','春日市','大野城市','宗像市','太宰府市','古賀市','福津市','うきは市','宮若市','嘉麻市','朝倉市','みやま市','糸島市','那珂川市','宇美町','篠栗町','志免町','須恵町','新宮町','久山町','粕屋町','芦屋町','水巻町','岡垣町','遠賀町','小竹町','鞍手町','桂川町','筑前町','東峰村','大刀洗町','大木町','香春町','添田町','糸田町','大任町','赤村','福智町','苅田町','みやこ町','吉富町','上毛町','築上町','ｻｶﾞｹﾝ','佐賀市','唐津市','鳥栖市','多久市','伊万里市','武雄市','鹿島市','小城市','嬉野市','神埼市','吉野ヶ里町','基山町','上峰町','みやき町','玄海町','有田町','大町町','江北町','白石町','太良町','ﾅｶﾞｻｷｹﾝ','長崎市','佐世保市','島原市','諫早市','大村市','平戸市','松浦市','対馬市','壱岐市','五島市','西海市','雲仙市','南島原市','長与町','時津町','東彼杵町','川棚町','波佐見町','小値賀町','佐々町','新上五島町','ｸﾏﾓﾄｹﾝ','熊本市','八代市','人吉市','荒尾市','水俣市','玉名市','山鹿市','菊池市','宇土市','上天草市','宇城市','阿蘇市','天草市','合志市','玉東町','南関町','長洲町','和水町','大津町','菊陽町','南小国町','産山村','西原村','南阿蘇村','御船町','嘉島町','益城町','甲佐町','山都町','氷川町','芦北町','津奈木町','錦町','多良木町','湯前町','水上村','相良村','五木村','山江村','球磨村','あさぎり町','苓北町','ｵｵｲﾀｹﾝ','大分市','別府市','中津市','日田市','佐伯市','臼杵市','津久見市','竹田市','豊後高田市','杵築市','宇佐市','豊後大野市','由布市','国東市','姫島村','日出町','九重町','玖珠町','ﾐﾔｻﾞｷｹﾝ','宮崎市','都城市','延岡市','日南市','小林市','日向市','串間市','西都市','えびの市','三股町','高原町','国富町','綾町','高鍋町','新富町','西米良村','木城町','川南町','都農町','門川町','諸塚村','椎葉村','高千穂町','日之影町','五ヶ瀬町','ｶｺﾞｼﾏｹﾝ','鹿児島市','鹿屋市','枕崎市','阿久根市','出水市','指宿市','西之表市','垂水市','薩摩川内市','日置市','曽於市','霧島市','いちき串木野市','南さつま市','志布志市','奄美市','南九州市','伊佐市','姶良市','三島村','十島村','さつま町','長島町','湧水町','大崎町','東串良町','錦江町','南大隅町','肝付町','中種子町','南種子町','屋久島町','大和村','宇検村','瀬戸内町','龍郷町','喜界町','徳之島町','天城町','伊仙町','和泊町','知名町','与論町','ｵｷﾅﾜｹﾝ','那覇市','宜野湾市','石垣市','浦添市','名護市','糸満市','沖縄市','豊見城市','うるま市','宮古島市','南城市','国頭村','大宜味村','東村','今帰仁村','本部町','恩納村','宜野座村','金武町','伊江村','読谷村','嘉手納町','北谷町','北中城村','中城村','西原町','与那原町','南風原町','渡嘉敷村','座間味村','粟国村','渡名喜村','南大東村','北大東村','伊平屋村','伊是名村','久米島町','八重瀬町','多良間村','竹富町','与那国町','','札幌市中央区','札幌市北区','札幌市東区','札幌市白石区','札幌市豊平区','札幌市南区','札幌市西区','札幌市厚別区','札幌市手稲区','札幌市清田区','仙台市青葉区','仙台市宮城野区','仙台市若林区','仙台市太白区','仙台市泉区','さいたま市西区','さいたま市北区','さいたま市大宮区','さいたま市見沼区','さいたま市中央区','さいたま市桜区','さいたま市浦和区','さいたま市南区','さいたま市緑区','さいたま市岩槻区','千葉市中央区','千葉市花見川区','千葉市稲毛区','千葉市若葉区','千葉市緑区','千葉市美浜区','横浜市鶴見区','横浜市神奈川区','横浜市西区','横浜市中区','横浜市南区','横浜市保土ケ谷区','横浜市磯子区','横浜市金沢区','横浜市港北区','横浜市戸塚区','横浜市港南区','横浜市旭区','横浜市緑区','横浜市瀬谷区','横浜市栄区','横浜市泉区','横浜市青葉区','横浜市都筑区','川崎市川崎区','川崎市幸区','川崎市中原区','川崎市高津区','川崎市多摩区','川崎市宮前区','川崎市麻生区','相模原市緑区','相模原市中央区','相模原市南区','新潟市北区','新潟市東区','新潟市中央区','新潟市江南区','新潟市秋葉区','新潟市南区','新潟市西区','新潟市西蒲区','静岡市葵区','静岡市駿河区','静岡市清水区','浜松市中央区','浜松市浜名区','浜松市天竜区','名古屋市千種区','名古屋市東区','名古屋市北区','名古屋市西区','名古屋市中村区','名古屋市中区','名古屋市昭和区','名古屋市瑞穂区','名古屋市熱田区','名古屋市中川区','名古屋市港区','名古屋市南区','名古屋市守山区','名古屋市緑区','名古屋市名東区','名古屋市天白区','京都市北区','京都市上京区','京都市左京区','京都市中京区','京都市東山区','京都市下京区','京都市南区','京都市右京区','京都市伏見区','京都市山科区','京都市西京区','大阪市都島区','大阪市福島区','大阪市此花区','大阪市西区','大阪市港区','大阪市大正区','大阪市天王寺区','大阪市浪速区','大阪市西淀川区','大阪市東淀川区','大阪市東成区','大阪市生野区','大阪市旭区','大阪市城東区','大阪市阿倍野区','大阪市住吉区','大阪市東住吉区','大阪市西成区','大阪市淀川区','大阪市鶴見区','大阪市住之江区','大阪市平野区','大阪市北区','大阪市中央区','堺市堺区','堺市中区','堺市東区','堺市西区','堺市南区','堺市北区','堺市美原区','神戸市東灘区','神戸市灘区','神戸市兵庫区','神戸市長田区','神戸市須磨区','神戸市垂水区','神戸市北区','神戸市中央区','神戸市西区','岡山市北区','岡山市中区','岡山市東区','岡山市南区','広島市中区','広島市東区','広島市南区','広島市西区','広島市安佐南区','広島市安佐北区','広島市安芸区','広島市佐伯区','北九州市門司区','北九州市若松区','北九州市戸畑区','北九州市小倉北区','北九州市小倉南区','北九州市八幡東区','北九州市八幡西区','福岡市東区','福岡市博多区','福岡市中央区','福岡市南区','福岡市西区','福岡市城南区','福岡市早良区','熊本市中央区','熊本市東区','熊本市西区','熊本市南区','熊本市北区' ]

#len(dfName[dfName['firstname'].str.startswith('四十崎')== True])


# In[82]:


def firstNameCheck(s):
    cnt=len(s)
    nameFlg = -1
    findName=""
    for i in range(cnt):
        if len(dfName[dfName['firstname'] == s[:cnt]])> 0:
            nameFlg = 1
            findName = s[:cnt]
            break
        cnt=cnt-1
    return nameFlg


# In[3]:


def checkTelAdd(add,tel):
    global dfTA
    rt=-1
    for index,item in dfTA.iterrows():
        if add.find(item[0]) > -1 and tel[:len(item[1])] ==item[1]: 
            #print(item)
            rt=1
            break
    return rt


# In[26]:


def getAdd(sor):
    AddStr = ""
    AddStr1 = ""
    zipFlg = -1
    s=sor.replace('\n','').replace('<br>','').replace('&lt;','').replace('&gt;','').replace('n_2','')
    sor=removeTagInfo(sor)
    if sor.find('本社所在地') != -1:
        s = s[s.find('本社所在地')+3:]
    elif sor.find('本社住所') != -1:
        s = s[s.find('本社住所')+3:]    
    elif sor.find('住所') != -1:
        s = s[s.find('住所')+3:]
    elif s.find('所在地') != -1:
        s = s[s.find('所在地')+3:]
    elif s.find('本社') != -1:
        s = s[s.find('本社')+2:]
    elif s.find('本店') != -1:
        s = s[s.find('本店')+2:]
    elif s.find('本部') != -1:
        s = s[s.find('本部')+2:]
    elif s.upper().find('OFFICE') != -1:
        s = s[s.upper().find('OFFICE')+6:]
    elif s.find('オフィス') != -1:
        s = s[s.find('オフィス')+4:]
    
    pattern = r'〒[\d]{3,4}-[\d]{3,4}'
    res = re.findall(pattern, s)
    if res :
        for i in res:
            AddStr1=i[0:9]
            s = s[s.find(AddStr1)+9:]
            zipFlg=1
            break
    if zipFlg == -1 : 
        pattern = r'〒[\d]{3,4}[\d]{3,4}'
        res = re.findall(pattern, s)
        if res :
            for i in res:
                AddStr1=i[0:8]
                s = s[s.find(AddStr1)+8:]
                zipFlg=1
                break
    if zipFlg == -1 :  
        pattern = r'[\d]{3,4}-[\d]{3,4}'
        res = re.findall(pattern, s)
        if res :
            for i in res:
                AddStr1=i[0:8] 
                s = s[s.find(AddStr1)+8:]
                break
    if zipFlg == -1 :  
        pattern = r'[\d]{3,4}－[\d]{3,4}'
        res = re.findall(pattern, s)
        if res :
            for i in res:
                AddStr1=i[0:8] 
                s = s[s.find(AddStr1)+8:]
                break    
    AddStr =s
    #AddStr = s[s.find(AddStr1):]
    if AddStr.find('<') != -1:    AddStr = AddStr[:AddStr.find('<')]

    if AddStr == '':AddStr = findAddStr(s)
    if AddStr == '':AddStr = findAddStr(sor)
    AddStr=modifyAdd(AddStr)
    if findAddStr(AddStr) == '' : AddStr=''
    AddStr = AddStr.replace('本社所在地','').replace('本社住所','').replace('住所','').replace('所在地','').replace('本社','').replace('本店','').replace('本部','').replace('オフィス','').replace('Office','').replace('OFFICE','').replace(' ','').replace(',','').replace('em>は','').replace('　','').replace('（','').replace('（','）').replace('移転','').replace('】','').replace('【','').replace('／','').replace('〉','').replace(':','')
    if len(AddStr ) > 50 or len(AddStr) < 10: AddStr=""
    AddStr=addFirstWordCheck(AddStr)
    AddStr=addLastWordCheck(AddStr)
    return AddStr


# In[3]:


def addFirstWordCheck(AddStr):
    findFlg=-1
    global sugAddChk
    global sugSubAddChk
    for i in sugAddChk:
        #print( "|" + i  + "|" + AddStr[0:len(i)]+"|" + " " + str(AddStr[0:len(i)]==i) + " "+ str(len(i) ))
        if AddStr[0:len(i)]==i and len(i) > 1 :
            findFlg=1
            break
    if findFlg==-1:
        for i in sugSubAddChk:
            #print( "|" + i  + "|" + AddStr[0:len(i)]+"|" + " " + str(AddStr[0:len(i)]==i) + " "+ str(len(i) ))
            if AddStr[0:len(i)]==i and len(i) > 1:
                findFlg=1
                break
    if findFlg==-1: 
        for i in sugAddChk:
            #print( "|" + i  + "|" + AddStr[0:len(i)]+"|" + " " + str(AddStr[0:len(i)]==i) + " "+ str(len(i) ))
            if AddStr.find(i) > -1 and len(i) > 1:
                AddStr=AddStr[AddStr.find(i):]
                findFlg=1
                break
    if findFlg==-1: 
        for i in sugSubAddChk:
            #print( "|" + i  + "|" + AddStr[0:len(i)]+"|" + " " + str(AddStr[0:len(i)]==i) + " "+ str(len(i) ))
            if AddStr.find(i) > -1 and len(i) > 1:
                AddStr=AddStr[AddStr.find(i):]
                findFlg=1
                break
    return AddStr


# In[13]:


def addLastWordCheck(AddStr):
    addLastChar=['0','０','1','１','2','２','3','３','4','４','5','５','6','６','7','７','8','８','9','９','A','A','B','Ｂ','C','Ｃ','F','Ｆ','f','ル','ン','地','番','階','号','寺','室','所','ー']
    if (AddStr[-1:] in addLastChar) == False:
        checkFlg = -1
        cnt=len(AddStr)
        for i in reversed(AddStr):
            if (i in addLastChar) == True: 
                AddStr=AddStr[:cnt]
                checkFlg=1
                break
            cnt=cnt-1
        if checkFlg==-1:AddStr=""
        
    return AddStr


# In[9]:


def findAddStr(s):
    rtStr=''
    addList=[]
    #s=driver.page_source
    global sugAddChk
    global sugSubAddChk
    #sugAddChk = ['北海道','青森県','岩手県','宮城県','秋田県','山形県','福島県','茨城県','栃木県','群馬県','埼玉県','千葉県','東京都','神奈川県','新潟県','富山県','石川県','福井県','山梨県','長野県','岐阜県','静岡県','愛知県','三重県','滋賀県','京都府','大阪府','兵庫県','奈良県','和歌山県','鳥取県','島根県','岡山県','広島県','山口県','徳島県','香川県','愛媛県','高知県','福岡県','佐賀県','長崎県','熊本県','大分県','宮崎県','鹿児島県','沖縄県']
    #sugSubAddChk =['ﾎｯｶｲﾄﾞｳ','札幌市','函館市','小樽市','旭川市','室蘭市','釧路市','帯広市','北見市','夕張市','岩見沢市','網走市','留萌市','苫小牧市','稚内市','美唄市','芦別市','江別市','赤平市','紋別市','士別市','名寄市','三笠市','根室市','千歳市','滝川市','砂川市','歌志内市','深川市','富良野市','登別市','恵庭市','伊達市','北広島市','石狩市','北斗市','当別町','新篠津村','松前町','福島町','知内町','木古内町','七飯町','鹿部町','森町','八雲町','長万部町','江差町','上ノ国町','厚沢部町','乙部町','奥尻町','今金町','せたな町','島牧村','寿都町','黒松内町','蘭越町','ニセコ町','真狩村','留寿都村','喜茂別町','京極町','倶知安町','共和町','岩内町','泊村','神恵内村','積丹町','古平町','仁木町','余市町','赤井川村','南幌町','奈井江町','上砂川町','由仁町','長沼町','栗山町','月形町','浦臼町','新十津川町','妹背牛町','秩父別町','雨竜町','北竜町','沼田町','鷹栖町','東神楽町','当麻町','比布町','愛別町','上川町','東川町','美瑛町','上富良野町','中富良野町','南富良野町','占冠村','和寒町','剣淵町','下川町','美深町','音威子府村','中川町','幌加内町','増毛町','小平町','苫前町','羽幌町','初山別村','遠別町','天塩町','猿払村','浜頓別町','中頓別町','枝幸町','豊富町','礼文町','利尻町','利尻富士町','幌延町','美幌町','津別町','斜里町','清里町','小清水町','訓子府町','置戸町','佐呂間町','遠軽町','湧別町','滝上町','興部町','西興部村','雄武町','大空町','豊浦町','壮瞥町','白老町','厚真町','洞爺湖町','安平町','むかわ町','日高町','平取町','新冠町','浦河町','様似町','えりも町','新ひだか町','音更町','士幌町','上士幌町','鹿追町','新得町','清水町','芽室町','中札内村','更別村','大樹町','広尾町','幕別町','池田町','豊頃町','本別町','足寄町','陸別町','浦幌町','釧路町','厚岸町','浜中町','標茶町','弟子屈町','鶴居村','白糠町','別海町','中標津町','標津町','羅臼町','色丹村','留夜別村','留別村','紗那村','蘂取村','ｱｵﾓﾘｹﾝ','青森市','弘前市','八戸市','黒石市','五所川原市','十和田市','三沢市','むつ市','つがる市','平川市','平内町','今別町','蓬田村','外ヶ浜町','鰺ヶ沢町','深浦町','西目屋村','藤崎町','大鰐町','田舎館村','板柳町','鶴田町','中泊町','野辺地町','七戸町','六戸町','横浜町','東北町','六ヶ所村','おいらせ町','大間町','東通村','風間浦村','佐井村','三戸町','五戸町','田子町','南部町','階上町','新郷村','ｲﾜﾃｹﾝ','盛岡市','宮古市','大船渡市','花巻市','北上市','久慈市','遠野市','一関市','陸前高田市','釜石市','二戸市','八幡平市','奥州市','滝沢市','雫石町','葛巻町','岩手町','紫波町','矢巾町','西和賀町','金ケ崎町','平泉町','住田町','大槌町','山田町','岩泉町','田野畑村','普代村','軽米町','野田村','九戸村','洋野町','一戸町','ﾐﾔｷﾞｹﾝ','仙台市','石巻市','塩竈市','気仙沼市','白石市','名取市','角田市','多賀城市','岩沼市','登米市','栗原市','東松島市','大崎市','富谷市','蔵王町','七ヶ宿町','大河原町','村田町','柴田町','川崎町','丸森町','亘理町','山元町','松島町','七ヶ浜町','利府町','大和町','大郷町','大衡村','色麻町','加美町','涌谷町','美里町','女川町','南三陸町','ｱｷﾀｹﾝ','秋田市','能代市','横手市','大館市','男鹿市','湯沢市','鹿角市','由利本荘市','潟上市','大仙市','北秋田市','にかほ市','仙北市','小坂町','上小阿仁村','藤里町','三種町','八峰町','五城目町','八郎潟町','井川町','大潟村','美郷町','羽後町','東成瀬村','ﾔﾏｶﾞﾀｹﾝ','山形市','米沢市','鶴岡市','酒田市','新庄市','寒河江市','上山市','村山市','長井市','天童市','東根市','尾花沢市','南陽市','山辺町','中山町','河北町','西川町','朝日町','大江町','大石田町','金山町','最上町','舟形町','真室川町','大蔵村','鮭川村','戸沢村','高畠町','川西町','小国町','白鷹町','飯豊町','三川町','庄内町','遊佐町','ﾌｸｼﾏｹﾝ','福島市','会津若松市','郡山市','いわき市','白河市','須賀川市','喜多方市','相馬市','二本松市','田村市','南相馬市','本宮市','桑折町','国見町','川俣町','大玉村','鏡石町','天栄村','下郷町','檜枝岐村','只見町','南会津町','北塩原村','西会津町','磐梯町','猪苗代町','会津坂下町','湯川村','柳津町','三島町','昭和村','会津美里町','西郷村','泉崎村','中島村','矢吹町','棚倉町','矢祭町','塙町','鮫川村','石川町','玉川村','平田村','浅川町','古殿町','三春町','小野町','広野町','楢葉町','富岡町','川内村','大熊町','双葉町','浪江町','葛尾村','新地町','飯舘村','ｲﾊﾞﾗｷｹﾝ','水戸市','日立市','土浦市','古河市','石岡市','結城市','龍ケ崎市','下妻市','常総市','常陸太田市','高萩市','北茨城市','笠間市','取手市','牛久市','つくば市','ひたちなか市','鹿嶋市','潮来市','守谷市','常陸大宮市','那珂市','筑西市','坂東市','稲敷市','かすみがうら市','桜川市','神栖市','行方市','鉾田市','つくばみらい市','小美玉市','茨城町','大洗町','城里町','東海村','大子町','美浦村','阿見町','河内町','八千代町','五霞町','境町','利根町','ﾄﾁｷﾞｹﾝ','宇都宮市','足利市','栃木市','佐野市','鹿沼市','日光市','小山市','真岡市','大田原市','矢板市','那須塩原市','さくら市','那須烏山市','下野市','上三川町','益子町','茂木町','市貝町','芳賀町','壬生町','野木町','塩谷町','高根沢町','那須町','那珂川町','ｸﾞﾝﾏｹﾝ','前橋市','高崎市','桐生市','伊勢崎市','太田市','沼田市','館林市','渋川市','藤岡市','富岡市','安中市','みどり市','榛東村','吉岡町','上野村','神流町','下仁田町','南牧村','甘楽町','中之条町','長野原町','嬬恋村','草津町','高山村','東吾妻町','片品村','川場村','みなかみ町','玉村町','板倉町','明和町','千代田町','大泉町','邑楽町','ｻｲﾀﾏｹﾝ','さいたま市','川越市','熊谷市','川口市','行田市','秩父市','所沢市','飯能市','加須市','本庄市','東松山市','春日部市','狭山市','羽生市','鴻巣市','深谷市','上尾市','草加市','越谷市','蕨市','戸田市','入間市','朝霞市','志木市','和光市','新座市','桶川市','久喜市','北本市','八潮市','富士見市','三郷市','蓮田市','坂戸市','幸手市','鶴ヶ島市','日高市','吉川市','ふじみ野市','白岡市','伊奈町','三芳町','毛呂山町','越生町','滑川町','嵐山町','小川町','川島町','吉見町','鳩山町','ときがわ町','横瀬町','皆野町','長瀞町','小鹿野町','東秩父村','神川町','上里町','寄居町','宮代町','杉戸町','松伏町','ﾁﾊﾞｹﾝ','千葉市','銚子市','市川市','船橋市','館山市','木更津市','松戸市','野田市','茂原市','成田市','佐倉市','東金市','旭市','習志野市','柏市','勝浦市','市原市','流山市','八千代市','我孫子市','鴨川市','鎌ケ谷市','君津市','富津市','浦安市','四街道市','袖ケ浦市','八街市','印西市','白井市','富里市','南房総市','匝瑳市','香取市','山武市','いすみ市','大網白里市','酒々井町','栄町','神崎町','多古町','東庄町','九十九里町','芝山町','横芝光町','一宮町','睦沢町','長生村','白子町','長柄町','長南町','大多喜町','御宿町','鋸南町','ﾄｳｷｮｳﾄ','千代田区','中央区','港区','新宿区','文京区','台東区','墨田区','江東区','品川区','目黒区','大田区','世田谷区','渋谷区','中野区','杉並区','豊島区','北区','荒川区','板橋区','練馬区','足立区','葛飾区','江戸川区','八王子市','立川市','武蔵野市','三鷹市','青梅市','府中市','昭島市','調布市','町田市','小金井市','小平市','日野市','東村山市','国分寺市','国立市','福生市','狛江市','東大和市','清瀬市','東久留米市','武蔵村山市','多摩市','稲城市','羽村市','あきる野市','西東京市','瑞穂町','日の出町','檜原村','奥多摩町','大島町','利島村','新島村','神津島村','三宅村','御蔵島村','八丈町','青ヶ島村','小笠原村','ｶﾅｶﾞﾜｹﾝ','横浜市','川崎市','相模原市','横須賀市','平塚市','鎌倉市','藤沢市','小田原市','茅ヶ崎市','逗子市','三浦市','秦野市','厚木市','大和市','伊勢原市','海老名市','座間市','南足柄市','綾瀬市','葉山町','寒川町','大磯町','二宮町','中井町','大井町','松田町','山北町','開成町','箱根町','真鶴町','湯河原町','愛川町','清川村','ﾆｲｶﾞﾀｹﾝ','新潟市','長岡市','三条市','柏崎市','新発田市','小千谷市','加茂市','十日町市','見附市','村上市','燕市','糸魚川市','妙高市','五泉市','上越市','阿賀野市','佐渡市','魚沼市','南魚沼市','胎内市','聖籠町','弥彦村','田上町','阿賀町','出雲崎町','湯沢町','津南町','刈羽村','関川村','粟島浦村','ﾄﾔﾏｹﾝ','富山市','高岡市','魚津市','氷見市','滑川市','黒部市','砺波市','小矢部市','南砺市','射水市','舟橋村','上市町','立山町','入善町','ｲｼｶﾜｹﾝ','金沢市','七尾市','小松市','輪島市','珠洲市','加賀市','羽咋市','かほく市','白山市','能美市','野々市市','川北町','津幡町','内灘町','志賀町','宝達志水町','中能登町','穴水町','能登町','ﾌｸｲｹﾝ','福井市','敦賀市','小浜市','大野市','勝山市','鯖江市','あわら市','越前市','坂井市','永平寺町','南越前町','越前町','美浜町','高浜町','おおい町','若狭町','ﾔﾏﾅｼｹﾝ','甲府市','富士吉田市','都留市','山梨市','大月市','韮崎市','南アルプス市','北杜市','甲斐市','笛吹市','上野原市','甲州市','中央市','市川三郷町','早川町','身延町','富士川町','昭和町','道志村','西桂町','忍野村','山中湖村','鳴沢村','富士河口湖町','小菅村','丹波山村','ﾅｶﾞﾉｹﾝ','長野市','松本市','上田市','岡谷市','飯田市','諏訪市','須坂市','小諸市','伊那市','駒ヶ根市','中野市','大町市','飯山市','茅野市','塩尻市','佐久市','千曲市','東御市','安曇野市','小海町','川上村','南相木村','北相木村','佐久穂町','軽井沢町','御代田町','立科町','青木村','長和町','下諏訪町','富士見町','原村','辰野町','箕輪町','飯島町','南箕輪村','中川村','宮田村','松川町','高森町','阿南町','阿智村','平谷村','根羽村','下條村','売木村','天龍村','泰阜村','喬木村','豊丘村','大鹿村','上松町','南木曽町','木祖村','王滝村','大桑村','木曽町','麻績村','生坂村','山形村','朝日村','筑北村','松川村','白馬村','小谷村','坂城町','小布施町','山ノ内町','木島平村','野沢温泉村','信濃町','小川村','飯綱町','栄村','ｷﾞﾌｹﾝ','岐阜市','大垣市','高山市','多治見市','関市','中津川市','美濃市','瑞浪市','羽島市','恵那市','美濃加茂市','土岐市','各務原市','可児市','山県市','瑞穂市','飛騨市','本巣市','郡上市','下呂市','海津市','岐南町','笠松町','養老町','垂井町','関ケ原町','神戸町','輪之内町','安八町','揖斐川町','大野町','北方町','坂祝町','富加町','川辺町','七宗町','八百津町','白川町','東白川村','御嵩町','白川村','ｼｽﾞｵｶｹﾝ','静岡市','浜松市','沼津市','熱海市','三島市','富士宮市','伊東市','島田市','富士市','磐田市','焼津市','掛川市','藤枝市','御殿場市','袋井市','下田市','裾野市','湖西市','伊豆市','御前崎市','菊川市','伊豆の国市','牧之原市','東伊豆町','河津町','南伊豆町','松崎町','西伊豆町','函南町','長泉町','小山町','吉田町','川根本町','ｱｲﾁｹﾝ','名古屋市','豊橋市','岡崎市','一宮市','瀬戸市','半田市','春日井市','豊川市','津島市','碧南市','刈谷市','豊田市','安城市','西尾市','蒲郡市','犬山市','常滑市','江南市','小牧市','稲沢市','新城市','東海市','大府市','知多市','知立市','尾張旭市','高浜市','岩倉市','豊明市','日進市','田原市','愛西市','清須市','北名古屋市','弥富市','みよし市','あま市','長久手市','東郷町','豊山町','大口町','扶桑町','大治町','蟹江町','飛島村','阿久比町','東浦町','南知多町','武豊町','幸田町','設楽町','東栄町','豊根村','ﾐｴｹﾝ','津市','四日市市','伊勢市','松阪市','桑名市','鈴鹿市','名張市','尾鷲市','亀山市','鳥羽市','熊野市','いなべ市','志摩市','伊賀市','木曽岬町','東員町','菰野町','川越町','多気町','大台町','玉城町','度会町','大紀町','南伊勢町','紀北町','御浜町','紀宝町','ｼｶﾞｹﾝ','大津市','彦根市','長浜市','近江八幡市','草津市','守山市','栗東市','甲賀市','野洲市','湖南市','高島市','東近江市','米原市','日野町','竜王町','愛荘町','豊郷町','甲良町','多賀町','ｷｮｳﾄﾌ','京都市','福知山市','舞鶴市','綾部市','宇治市','宮津市','亀岡市','城陽市','向日市','長岡京市','八幡市','京田辺市','京丹後市','南丹市','木津川市','大山崎町','久御山町','井手町','宇治田原町','笠置町','和束町','精華町','南山城村','京丹波町','伊根町','与謝野町','ｵｵｻｶﾌ','大阪市','堺市','岸和田市','豊中市','池田市','吹田市','泉大津市','高槻市','貝塚市','守口市','枚方市','茨木市','八尾市','泉佐野市','富田林市','寝屋川市','河内長野市','松原市','大東市','和泉市','箕面市','柏原市','羽曳野市','門真市','摂津市','高石市','藤井寺市','東大阪市','泉南市','四條畷市','交野市','大阪狭山市','阪南市','島本町','豊能町','能勢町','忠岡町','熊取町','田尻町','岬町','太子町','河南町','千早赤阪村','ﾋｮｳｺﾞｹﾝ','神戸市','姫路市','尼崎市','明石市','西宮市','洲本市','芦屋市','伊丹市','相生市','豊岡市','加古川市','赤穂市','西脇市','宝塚市','三木市','高砂市','川西市','小野市','三田市','加西市','丹波篠山市','養父市','丹波市','南あわじ市','朝来市','淡路市','宍粟市','加東市','たつの市','猪名川町','多可町','稲美町','播磨町','市川町','福崎町','神河町','上郡町','佐用町','香美町','新温泉町','ﾅﾗｹﾝ','奈良市','大和高田市','大和郡山市','天理市','橿原市','桜井市','五條市','御所市','生駒市','香芝市','葛城市','宇陀市','山添村','平群町','三郷町','斑鳩町','安堵町','三宅町','田原本町','曽爾村','御杖村','高取町','明日香村','上牧町','王寺町','広陵町','河合町','吉野町','大淀町','下市町','黒滝村','天川村','野迫川村','十津川村','下北山村','上北山村','東吉野村','ﾜｶﾔﾏｹﾝ','和歌山市','海南市','橋本市','有田市','御坊市','田辺市','新宮市','紀の川市','岩出市','紀美野町','かつらぎ町','九度山町','高野町','湯浅町','広川町','有田川町','由良町','印南町','みなべ町','日高川町','白浜町','上富田町','すさみ町','那智勝浦町','太地町','古座川町','北山村','串本町','ﾄｯﾄﾘｹﾝ','鳥取市','米子市','倉吉市','境港市','岩美町','若桜町','智頭町','八頭町','三朝町','湯梨浜町','琴浦町','北栄町','日吉津村','大山町','伯耆町','日南町','江府町','ｼﾏﾈｹﾝ','松江市','浜田市','出雲市','益田市','大田市','安来市','江津市','雲南市','奥出雲町','飯南町','川本町','邑南町','津和野町','吉賀町','海士町','西ノ島町','知夫村','隠岐の島町','ｵｶﾔﾏｹﾝ','岡山市','倉敷市','津山市','玉野市','笠岡市','井原市','総社市','高梁市','新見市','備前市','瀬戸内市','赤磐市','真庭市','美作市','浅口市','和気町','早島町','里庄町','矢掛町','新庄村','鏡野町','勝央町','奈義町','西粟倉村','久米南町','美咲町','吉備中央町','ﾋﾛｼﾏｹﾝ','広島市','呉市','竹原市','三原市','尾道市','福山市','三次市','庄原市','大竹市','東広島市','廿日市市','安芸高田市','江田島市','府中町','海田町','熊野町','坂町','安芸太田町','北広島町','大崎上島町','世羅町','神石高原町','ﾔﾏｸﾞﾁｹﾝ','下関市','宇部市','山口市','萩市','防府市','下松市','岩国市','光市','長門市','柳井市','美祢市','周南市','山陽小野田市','周防大島町','和木町','上関町','田布施町','平生町','阿武町','ﾄｸｼﾏｹﾝ','徳島市','鳴門市','小松島市','阿南市','吉野川市','阿波市','美馬市','三好市','勝浦町','上勝町','佐那河内村','石井町','神山町','那賀町','牟岐町','美波町','海陽町','松茂町','北島町','藍住町','板野町','上板町','つるぎ町','東みよし町','ｶｶﾞﾜｹﾝ','高松市','丸亀市','坂出市','善通寺市','観音寺市','さぬき市','東かがわ市','三豊市','土庄町','小豆島町','三木町','直島町','宇多津町','綾川町','琴平町','多度津町','まんのう町','ｴﾋﾒｹﾝ','松山市','今治市','宇和島市','八幡浜市','新居浜市','西条市','大洲市','伊予市','四国中央市','西予市','東温市','上島町','久万高原町','砥部町','内子町','伊方町','松野町','鬼北町','愛南町','ｺｳﾁｹﾝ','高知市','室戸市','安芸市','南国市','土佐市','須崎市','宿毛市','土佐清水市','四万十市','香南市','香美市','東洋町','奈半利町','田野町','安田町','北川村','馬路村','芸西村','本山町','大豊町','土佐町','大川村','いの町','仁淀川町','中土佐町','佐川町','越知町','梼原町','日高村','津野町','四万十町','大月町','三原村','黒潮町','ﾌｸｵｶｹﾝ','北九州市','福岡市','大牟田市','久留米市','直方市','飯塚市','田川市','柳川市','八女市','筑後市','大川市','行橋市','豊前市','中間市','小郡市','筑紫野市','春日市','大野城市','宗像市','太宰府市','古賀市','福津市','うきは市','宮若市','嘉麻市','朝倉市','みやま市','糸島市','那珂川市','宇美町','篠栗町','志免町','須恵町','新宮町','久山町','粕屋町','芦屋町','水巻町','岡垣町','遠賀町','小竹町','鞍手町','桂川町','筑前町','東峰村','大刀洗町','大木町','香春町','添田町','糸田町','大任町','赤村','福智町','苅田町','みやこ町','吉富町','上毛町','築上町','ｻｶﾞｹﾝ','佐賀市','唐津市','鳥栖市','多久市','伊万里市','武雄市','鹿島市','小城市','嬉野市','神埼市','吉野ヶ里町','基山町','上峰町','みやき町','玄海町','有田町','大町町','江北町','白石町','太良町','ﾅｶﾞｻｷｹﾝ','長崎市','佐世保市','島原市','諫早市','大村市','平戸市','松浦市','対馬市','壱岐市','五島市','西海市','雲仙市','南島原市','長与町','時津町','東彼杵町','川棚町','波佐見町','小値賀町','佐々町','新上五島町','ｸﾏﾓﾄｹﾝ','熊本市','八代市','人吉市','荒尾市','水俣市','玉名市','山鹿市','菊池市','宇土市','上天草市','宇城市','阿蘇市','天草市','合志市','玉東町','南関町','長洲町','和水町','大津町','菊陽町','南小国町','産山村','西原村','南阿蘇村','御船町','嘉島町','益城町','甲佐町','山都町','氷川町','芦北町','津奈木町','錦町','多良木町','湯前町','水上村','相良村','五木村','山江村','球磨村','あさぎり町','苓北町','ｵｵｲﾀｹﾝ','大分市','別府市','中津市','日田市','佐伯市','臼杵市','津久見市','竹田市','豊後高田市','杵築市','宇佐市','豊後大野市','由布市','国東市','姫島村','日出町','九重町','玖珠町','ﾐﾔｻﾞｷｹﾝ','宮崎市','都城市','延岡市','日南市','小林市','日向市','串間市','西都市','えびの市','三股町','高原町','国富町','綾町','高鍋町','新富町','西米良村','木城町','川南町','都農町','門川町','諸塚村','椎葉村','高千穂町','日之影町','五ヶ瀬町','ｶｺﾞｼﾏｹﾝ','鹿児島市','鹿屋市','枕崎市','阿久根市','出水市','指宿市','西之表市','垂水市','薩摩川内市','日置市','曽於市','霧島市','いちき串木野市','南さつま市','志布志市','奄美市','南九州市','伊佐市','姶良市','三島村','十島村','さつま町','長島町','湧水町','大崎町','東串良町','錦江町','南大隅町','肝付町','中種子町','南種子町','屋久島町','大和村','宇検村','瀬戸内町','龍郷町','喜界町','徳之島町','天城町','伊仙町','和泊町','知名町','与論町','ｵｷﾅﾜｹﾝ','那覇市','宜野湾市','石垣市','浦添市','名護市','糸満市','沖縄市','豊見城市','うるま市','宮古島市','南城市','国頭村','大宜味村','東村','今帰仁村','本部町','恩納村','宜野座村','金武町','伊江村','読谷村','嘉手納町','北谷町','北中城村','中城村','西原町','与那原町','南風原町','渡嘉敷村','座間味村','粟国村','渡名喜村','南大東村','北大東村','伊平屋村','伊是名村','久米島町','八重瀬町','多良間村','竹富町','与那国町','','札幌市中央区','札幌市北区','札幌市東区','札幌市白石区','札幌市豊平区','札幌市南区','札幌市西区','札幌市厚別区','札幌市手稲区','札幌市清田区','仙台市青葉区','仙台市宮城野区','仙台市若林区','仙台市太白区','仙台市泉区','さいたま市西区','さいたま市北区','さいたま市大宮区','さいたま市見沼区','さいたま市中央区','さいたま市桜区','さいたま市浦和区','さいたま市南区','さいたま市緑区','さいたま市岩槻区','千葉市中央区','千葉市花見川区','千葉市稲毛区','千葉市若葉区','千葉市緑区','千葉市美浜区','横浜市鶴見区','横浜市神奈川区','横浜市西区','横浜市中区','横浜市南区','横浜市保土ケ谷区','横浜市磯子区','横浜市金沢区','横浜市港北区','横浜市戸塚区','横浜市港南区','横浜市旭区','横浜市緑区','横浜市瀬谷区','横浜市栄区','横浜市泉区','横浜市青葉区','横浜市都筑区','川崎市川崎区','川崎市幸区','川崎市中原区','川崎市高津区','川崎市多摩区','川崎市宮前区','川崎市麻生区','相模原市緑区','相模原市中央区','相模原市南区','新潟市北区','新潟市東区','新潟市中央区','新潟市江南区','新潟市秋葉区','新潟市南区','新潟市西区','新潟市西蒲区','静岡市葵区','静岡市駿河区','静岡市清水区','浜松市中央区','浜松市浜名区','浜松市天竜区','名古屋市千種区','名古屋市東区','名古屋市北区','名古屋市西区','名古屋市中村区','名古屋市中区','名古屋市昭和区','名古屋市瑞穂区','名古屋市熱田区','名古屋市中川区','名古屋市港区','名古屋市南区','名古屋市守山区','名古屋市緑区','名古屋市名東区','名古屋市天白区','京都市北区','京都市上京区','京都市左京区','京都市中京区','京都市東山区','京都市下京区','京都市南区','京都市右京区','京都市伏見区','京都市山科区','京都市西京区','大阪市都島区','大阪市福島区','大阪市此花区','大阪市西区','大阪市港区','大阪市大正区','大阪市天王寺区','大阪市浪速区','大阪市西淀川区','大阪市東淀川区','大阪市東成区','大阪市生野区','大阪市旭区','大阪市城東区','大阪市阿倍野区','大阪市住吉区','大阪市東住吉区','大阪市西成区','大阪市淀川区','大阪市鶴見区','大阪市住之江区','大阪市平野区','大阪市北区','大阪市中央区','堺市堺区','堺市中区','堺市東区','堺市西区','堺市南区','堺市北区','堺市美原区','神戸市東灘区','神戸市灘区','神戸市兵庫区','神戸市長田区','神戸市須磨区','神戸市垂水区','神戸市北区','神戸市中央区','神戸市西区','岡山市北区','岡山市中区','岡山市東区','岡山市南区','広島市中区','広島市東区','広島市南区','広島市西区','広島市安佐南区','広島市安佐北区','広島市安芸区','広島市佐伯区','北九州市門司区','北九州市若松区','北九州市戸畑区','北九州市小倉北区','北九州市小倉南区','北九州市八幡東区','北九州市八幡西区','福岡市東区','福岡市博多区','福岡市中央区','福岡市南区','福岡市西区','福岡市城南区','福岡市早良区','熊本市中央区','熊本市東区','熊本市西区','熊本市南区','熊本市北区' ]
    s = s.replace('本社所在地','').replace('本社住所','').replace('住所','').replace('所在地','').replace('本社','').replace('本店','').replace('本部','').replace(' ','').replace(',','')
    for i in sugAddChk:
        if s.find(i) > -1 and len(i) > 0:
            rtStr = s[s.find(i):]
            rtStr = rtStr[:rtStr.find('<')]
            addList.append(rtStr)
    if len(rtStr ) < 3: 
        for i in sugSubAddChk:
            if s.find(i) > -1 and len(i) > 0:
                rtStr = s[s.find(i):]
                rtStr = rtStr[:rtStr.find('<')]    
                addList.append(rtStr)
    rtStr = ''
    for i in addList:
        if i.find('県')> -1 and i.find('市')> -1 and i.find('区')> -1 and i.find('番地')> -1 :
            rtStr = i
            break
    if rtStr == '':
        for i in addList:
            if i.find('市')> -1 and i.find('区')> -1 and i.find('番地')> -1 :
                rtStr = i
                break        
    
    if rtStr == '':
        for i in addList:
            if i.find('区')> -1 and i.find('番地')> -1 :
                rtStr = i
                break        
    if rtStr == '':
        for i in addList:
            if i.find('都')> -1 and i.find('区')> -1 :
                rtStr = i
                break        
    if rtStr == '':
        for i in addList:
            if i.find('県')> -1 and i.find('市')> -1 :
                rtStr = i
                break         
    if rtStr == '':
        for i in addList:
            if i.find('県')> -1 and i.find('町')> -1 :
                rtStr = i
                break                         
    if rtStr == '':
        for i in addList:
            if i.find('府')> -1 and i.find('市')> -1 :
                rtStr = i
                break       
    if rtStr == '':
        for i in addList:
            if  i.find('番地')> -1 :
                if len(re.findall(r'\d', s)) > 0:
                    rtStr = i
                    break                
    if rtStr == '':
        for i in addList:
            if  i.find('市')> -1 :
                if len(re.findall(r'\d', s)) > 0:
                    rtStr = i
                    break      
    #if rtStr == '':
    #    for i in addList:
    #        if  i.find('県')> -1 or i.find('市')> -1 or i.find('区')> -1 or i.find('番地')> -1 :
    #            rtStr = i
    #            break             
    if len(rtStr ) > 5 and rtStr.upper().find('TEL') > -1 : rtStr=rtStr[:rtStr.upper().find('TEL')]
    return rtStr
    
    #return AddStr


# In[25]:


def searchComName(sor):
    s=sor
    for i in sugAddChk:
        tempStr = i[:-1]
        if s.find(tempStr) > -1 and len(tempStr) > 0:
            s=s.replace(tempStr,'')
    for i in sugSubAddChk:
        tempStr = i[:-1]
        if s.find(tempStr) > -1 and len(tempStr) > 0:
            print(tempStr)
            s=s.replace(tempStr,'')
    return s


# In[8]:


def companyInfo():
    flg=-1
    url=''
    tel=''
    address=''
    global gl_tel
    global gl_address
    global driver
    global gl_buyFlg
    global gl_business
    cnt=0
    for i in driver.find_elements(By.TAG_NAME,'a'):
        inHTML = i.get_attribute('innerHTML')
        if inHTML.find('会社概要') > -1:
            #i.click()
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass
        elif inHTML.find('会社案内') > -1:
            #i.click();
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass

        elif inHTML.find('会社紹介') > -1 and exhibitURLCheck(url) !='':
            #i.click();
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass

        elif inHTML.find('ついて') > -1 and exhibitURLCheck(url) !='':
            #i.click();
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass

        elif inHTML.find('COMPANY') > -1 and exhibitURLCheck(url) !='':
            #i.click();
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass
        elif inHTML.find('CORPORATE') > -1 and exhibitURLCheck(url) !='':
            #i.click();
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass
        elif inHTML.find('運営会社') > -1 and exhibitURLCheck(url) !='':
            #i.click();
            if i.get_attribute('href') :
                url=i.get_attribute('href')
                flg=1
                if url.find('http') > -1 and exhibitURLCheck(url) !='': 
                    try:
                        refreshBrowse(url)
                        break;
                    except:
                        pass
                        

        if gl_buyFlg=='':
            allHTML = driver.page_source
            if allHTML.find('販売') > -1:
                gl_buyFlg='販売'
        cnt=cnt+1
        if cnt > 50 :break

    if url != '': comDetailInfo()
    if len(gl_tel) < 2:
        if tel.find('-')== -1: 
            tel = getTel(removeTagInfo(driver.page_source))
    if len(gl_tel) < 2:
        if address == '':
            address = getAdd(driver.page_source)
            #address=modifyAdd(address)
    if flg == -1 or len(gl_Money) < 2 and cnt < 50:        
        cnt=0
        for i in driver.find_elements(By.TAG_NAME,'a'):
            try:
                if i.get_attribute('href') :
                    url = i.get_attribute('href')
                    if len(url) > 3:
                        soup = i.get_attribute('innerHTML')
                        if soup.find('会社概要') > -1:
                            refreshBrowse(url)
                        elif soup.find('会社案内') > -1:
                            refreshBrowse(url)
                        elif soup.find('会社紹介') > -1:
                            refreshBrowse(url)
                        elif soup.find('資本金') > -1:
                            refreshBrowse(url)
                        elif soup.find('社員数') > -1:
                            refreshBrowse(url)
                        comDetailInfo()
            except:
                pass
            if len(gl_Money) > 2: break
            cnt=cnt+1
            if cnt > 50 :break

    if len(gl_tel) < 3:gl_tel = tel
    if len(gl_address) < 3:gl_address = cutStr(address)
    if gl_business[0:4] !='http' :gl_business=''

    return url


# In[5]:


def companyInfoExcept():
    flg=-1
    url=''
    tel=''
    address=''
    global gl_tel
    global gl_address
    global driver
    global gl_buyFlg
    global gl_business
    lisURL=[]
    for i in driver.find_elements(By.TAG_NAME,'a'):
        try:
            lisURL.append(i.get_attribute('href'))
        except:
            pass
    cnt=0
    for i in lisURL:
        try :
            if i.find('http') > -1 :
                refreshBrowse(i)
                comDetailInfo()
                
        except:
            pass
        if len(gl_business) > 2 :break
        cnt=cnt+1
        if cnt > 30 : break



# In[6]:


def companyContent():
    findData=''
    global driver
    for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/block-component/div/div[1]/div/div/div/div/div[1]/div/div/div/div/div[1]/div/span/span'):
        findData = i.get_attribute('innerHTML')
        if findData.find('<b>') > -1:
            findData = findData[findData.find('<b>')+3:]
            findData = findData[:findData.find('</b>')]
            if len(findData) > -1 and findData.find('http') == -1:
                break
    if findData == '':
        findData = extractValue('事業内容')
    if findData == '':
        findData = extractValue('事業形態')
        
    return findData


# In[29]:


def modifyAdd(s):
    rt=s
    lineEndList=['取締','交通','アクセス','営業','資本金','GOOGLE','電話','代表取締役','商品','代表者','会社設立','勤務地','ホームページ','(株)','地図','です','MAP',' ; タグ: #','JR','※','·','、',',','.','..','.','URL',':','&lt;','&gt','FAX','TEL','その他','·','【','[','《','（','『','06-','03-','創業','昭和','略歴','設','（','／',')','■','Eメール','EMAIL','E-MAIL']
    for i in lineEndList:
        if s.upper().find(i) > -1:
            temp = rt[:s.upper().find(i)]
            if len(temp) > 3:
                rt = temp
            
    return rt     


# In[83]:


def checkName(s):
    rt=s
    rt=rt.replace('メッセージ','').replace('執行役員','').replace('執行員','').replace('名前','').replace('代表者','').replace('代表','').replace('資本金','').replace('資本','').replace('取締役','').replace('就任','').replace('取締','').replace('役割','').replace('兼','').replace('役','').replace('氏','').replace('代表取締','').replace(',','').replace('会長','').replace('社長','').replace('代表取締','').replace('専務','').replace('副','').replace('.','').replace('/b','').replace(':','').replace(',','').replace(';','').replace('・','').replace('所在地','').replace('：','').replace('CEO','').replace('title>','').replace('ページ','').replace('1','').replace('>','').replace('<','').replace('、','').replace('続きを読','')
    if rt.find('就任') > -1 or rt.find('致しました') > -1  or rt.find('。') > -1:
        rt=''
    elif len(rt) < 3:
        rt=''

    if len(re.findall(r'\d+', rt)) > 0:
        temprt= rt[:rt.find(re.findall(r'\d+', rt)[0])]
        if len(temprt) > 2:rt=temprt
    
    rt=rt.lstrip().rstrip()
    if len(rt) > 6 and rt.count(' ') > 1:
        rt=rt[:rt.find(' ',6)  ]
        rt=rt.rstrip()
    if len(rt) > 6 and rt.count('（') > 1:
        rt=rt[:rt.find('（')  ]
        rt=rt.rstrip()
    rt.replace('：','')
    if firstNameCheck(rt ) == -1: rt="★" + rt
    return rt


# In[52]:


def getNoLinkText(soup, query):
    tempRt=''
    point=[]
    a=[m.start() for m in re.finditer(query, soup)]
    #soup=removeTagInfo(soup)
    cnt=0
    for i in a:
        if soup[i-1:i] == ">" :
            point.append(10)
        else:
            point.append(0)
        if soup[i+len(query):i+len(query)+1] == "<" : point[cnt]=point[cnt]+ 10
        if soup[i:i+300 ].replace('\n','').find('</a>') > -1 :
            point[cnt]=point[cnt]+ 0
        else:
            point[cnt]=point[cnt]+ 30
    #    print(soup[i-1:i])
    #    print(soup[i+len(query):i+len(query)+1])
        cnt=cnt+1
    
    selectionIndex = point.index(max(point))
    tempRt = soup[a[selectionIndex]:a[selectionIndex]+300 ].replace('\n','')
    return tempRt      


# In[8]:


def comDetailInfo(soup=''):
    global gl_Money
    global gl_president
    global gl_empNum
    global gl_address
    global gl_business
    global gl_tel
    global driver
    global gl_HPsource
    global gl_com
    global gl_askEmail
    tempRt=''
    gl_com=driver.current_url
    if soup=='':
        soup = driver.page_source
        if soup.find('<div class="GyAeWb"') > -1:
            soup=soup[soup.find('<div class="GyAeWb"'):]
    
    if soup.find('資本金') > -1 and len(gl_Money) < 1:
        soup=soup[soup.find('<body'):]
        tempRt=getNoLinkText(soup,'資本金')
        #tempRt = soup[soup.find('資本金'):soup.find('資本金')+300 ].replace('\n','')
        gl_Money = getNextTD(tempRt)
        if len(tempRt) > 0 and len(gl_Money) ==0 :
            gl_Money=removeTagInfo(tempRt)
        else:
            gl_Money=removeTagInfo(gl_Money)
        gl_Money=gl_Money.replace('資本金','').replace(' ','').replace('：','').replace('】','').replace('>','').replace('等, ','').replace('：','')
        if gl_Money[0:1]=='.':gl_Money=gl_Money[1:]
    if soup.find('代表取締') > -1 and len(gl_president) < 1:
        #tempRt = soup[soup.find('代表取締'):soup.find('代表取締')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'代表取締')
        tempRt=tempRt.lstrip().rstrip()
        gl_president = getNextTD(tempRt)
        if len(tempRt) > 0 and len(gl_president) ==0 :
            gl_president=removeTagInfo(tempRt)
        else:
            gl_president=removeTagInfo(gl_president)    
        gl_president=checkName(gl_president)
    if soup.find('代表者') > -1 and len(gl_president) < 1:
        #tempRt = soup[soup.find('代表者'):soup.find('代表者')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'代表者')
        tempRt=tempRt.lstrip().rstrip()
        gl_president = getNextTD(tempRt)
        if len(tempRt) > 0 and len(gl_president) ==0 :
            gl_president=removeTagInfo(tempRt)
        else:
            gl_president=removeTagInfo(gl_president)
        gl_president=checkName(gl_president)
    if soup.find('社長') > -1 and len(gl_president) < 1:
        #tempRt = soup[soup.find('社長'):soup.find('社長')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'社長')
        tempRt = cutStr(tempRt)
        tempRt=tempRt.lstrip().rstrip()
        gl_president = getNextTD(tempRt)
        if len(tempRt) > 0 and len(gl_president) ==0 :
            gl_president=removeTagInfo(tempRt)
        else:
            gl_president=removeTagInfo(gl_president)
                
        gl_president=checkName(gl_president)
    if soup.find('社員数') > -1 and len(gl_empNum) < 1:
        soup=soup[soup.find('<body'):]
        #tempRt = soup[soup.find('社員数'):soup.find('社員数')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'社員数')
        gl_empNum = getNextTD(tempRt)
        if len(tempRt) > 0 and len(gl_empNum) ==0 :
            gl_empNum=removeTagInfo(tempRt)
        else:
            gl_empNum=removeTagInfo(gl_empNum)
        gl_empNum=gl_empNum.replace('社員数','').replace(' ','').replace('　','').replace('は','').replace('】','').replace('数','').replace('等, ','').replace('社員, ','').replace('単体, ','').replace(':, ','').replace('単独, ','').replace('計, ','').replace('/, ','').replace('連結','').replace('・','').replace('>','')    
    if len(gl_empNum) < 1 :
        soup=soup[soup.find('<body'):]
        if soup.find('従業員数') > -1:
            #tempRt = soup[soup.find('従業員数'):soup.find('従業員数')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'従業員数')
            gl_empNum = getNextTD(tempRt)
            if len(tempRt) > 0 and len(gl_empNum) ==0 :
                gl_empNum=removeTagInfo(tempRt)
            else:
                gl_empNum=removeTagInfo(gl_empNum)
            gl_empNum=gl_empNum.replace('従業員数','').replace(' ','').replace('　','').replace('は','').replace('】','') .replace('数','').replace('等, ','').replace('社員, ','').replace('単体, ','').replace(':, ','').replace('単独, ','').replace('計, ','').replace('/, ','').replace('連結','').replace('・','').replace('>','')           
    if len(gl_empNum) < 1 :
        soup=soup[soup.find('<body'):]
        if soup.find('従業員') > -1:
            #tempRt = soup[soup.find('従業員数'):soup.find('従業員数')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'従業員')
            gl_empNum = getNextTD(tempRt)
            if len(tempRt) > 0 and len(gl_empNum) ==0 :
                gl_empNum=removeTagInfo(tempRt)
            else:
                gl_empNum=removeTagInfo(gl_empNum)
            gl_empNum=gl_empNum.replace('従業員','').replace(' ','').replace('　','').replace('は','').replace('】','') .replace('数','').replace('等, ','').replace('社員, ','').replace('単体, ','').replace(':, ','').replace('単独, ','').replace('計, ','').replace('/, ','').replace('連結','').replace('・','').replace('>','')       
    
    if soup.find('本社所在地') > -1 and len(gl_address) < 1:
        #tempRt = soup[soup.find('本社所在地'):soup.find('本社所在地')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'本社所在地')
        gl_address = getNextTD(tempRt)
        if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
            gl_address=removeTagInfo(tempRt)
        else:
            gl_address=removeTagInfo(gl_address)

        gl_address=gl_address.replace('本社所在地','').replace(' ','')   
        gl_address=modifyAdd(gl_address)
        gl_address=getAdd(gl_address)
    if soup.find('本社住所') > -1 and len(gl_address) < 1:
        #tempRt = soup[soup.find('本社住所'):soup.find('本社住所')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'本社住所')
        gl_address = getNextTD(tempRt)
        if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
            gl_address=removeTagInfo(tempRt)
        else:
            gl_address=removeTagInfo(gl_address)

        gl_address=gl_address.replace('本社住所','').replace(' ','')   
        gl_address=modifyAdd(gl_address)
        gl_address=getAdd(gl_address)
    
    if soup.find('住所') > -1 and len(gl_address) < 1:
        #tempRt = soup[soup.find('住所'):soup.find('住所')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'住所')
        gl_address = getNextTD(tempRt)
        if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
            gl_address=removeTagInfo(tempRt)
        else:
            gl_address=removeTagInfo(gl_address)

        gl_address=gl_address.replace('住所','').replace(' ','')   
        gl_address=modifyAdd(gl_address)
        gl_address=getAdd(gl_address)

        #gl_address=modifyAdd(gl_address)
    if len(gl_address) < 3:
        if soup.find('所在地') > -1:
            #tempRt = soup[soup.find('所在地'):soup.find('所在地')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'所在地')
            gl_address = getNextTD(tempRt)
            if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
                gl_address=removeTagInfo(tempRt)
            else:
                gl_address=removeTagInfo(gl_address)
    
            gl_address=gl_address.replace('所在地','').replace(' ','')   
            gl_address=modifyAdd(gl_address)
            gl_address=getAdd(gl_address)

    if len(gl_address) < 3:
        if soup.find('本社') > -1:
            #tempRt = soup[soup.find('本社'):soup.find('本社')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'本社')
            gl_address = getNextTD(tempRt)
            
            if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
                gl_address=removeTagInfo(tempRt)
            else:
                gl_address=removeTagInfo(gl_address)
    
            gl_address=gl_address.replace('本社','').replace(' ','')   
            gl_address=modifyAdd(gl_address)
            gl_address=getAdd(gl_address)   
    if len(gl_address) < 3:
        if soup.find('本部') > -1:
            #tempRt = soup[soup.find('本部'):soup.find('本部')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'本部')
            gl_address = getNextTD(tempRt)
            if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
                gl_address=removeTagInfo(tempRt)
            else:
                gl_address=removeTagInfo(gl_address)
    
            gl_address=gl_address.replace('本部','').replace(' ','')   
            gl_address=modifyAdd(gl_address)
            gl_address=getAdd(gl_address)   
    if len(gl_address) < 3:
        if soup.find('本店') > -1:
            #tempRt = soup[soup.find('本店'):soup.find('本店')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'本店')
            gl_address = getNextTD(tempRt)
            if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
                gl_address=removeTagInfo(tempRt)
            else:
                gl_address=removeTagInfo(gl_address)
    
            gl_address=gl_address.replace('本店','').replace(' ','')   
            gl_address=modifyAdd(gl_address)
            gl_address=getAdd(gl_address)    
    if len(gl_address) < 3:
        if soup.find('本所') > -1:
            #tempRt = soup[soup.find('本店'):soup.find('本店')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'本所')
            gl_address = getNextTD(tempRt)
            if (len(tempRt) > 0 and len(gl_address) ==0 ) or findAddStr(gl_address) == '':
                gl_address=removeTagInfo(tempRt)
            else:
                gl_address=removeTagInfo(gl_address)
    
            gl_address=gl_address.replace('本所','').replace(' ','')   
            gl_address=modifyAdd(gl_address)
            gl_address=getAdd(gl_address)    
            
    soup=soup[soup.find('<body'):]
    if len(gl_business ) < 3:
        if soup.find('事業内容') > -1:
            #tempRt = soup[soup.find('事業内容'):soup.find('事業内容')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'事業内容')
            gl_business = getNextTD(tempRt)
            if len(tempRt) > 0 and len(gl_business) ==0 :
                gl_business=removeTagInfo(tempRt)
            else:
                gl_business=removeTagInfo(gl_business)
            gl_business=gl_business.replace('事業内容','').replace(' ','')
    if soup.find('業務内容') > -1 and len(gl_business) < 1:
        #tempRt = soup[soup.find('業務内容'):soup.find('業務内容')+300 ].replace('\n','')
        tempRt=getNoLinkText(soup,'業務内容')
        gl_business = getNextTD(tempRt)
        if len(tempRt) > 0 and len(gl_business) ==0 :
            gl_business=removeTagInfo(tempRt)
        else:
            gl_business=removeTagInfo(gl_business)
        gl_business=gl_business.replace('業務内容','').replace(' ','')
            #gl_business = removeTagInfo(getNextTD(soup[soup.find('事業内容'):soup.find('事業内容')+300 ].replace('\n','')))
            #gl_business=gl_business.replace('事業内容','').replace(' ','')
    if len(gl_business ) < 3:
        if soup.find('事業形態') > -1:
            #tempRt = soup[soup.find('事業形態'):soup.find('事業形態')+300 ].replace('\n','')
            tempRt=getNoLinkText(soup,'事業形態')
            gl_business = getNextTD(tempRt)
            if len(tempRt) > 0 and len(gl_business) ==0 :
                gl_business=removeTagInfo(tempRt)
            else:
                gl_business=removeTagInfo(gl_business)
            gl_business=gl_business.replace('事業形態','').replace(' ','')
    if len(gl_business ) < 3:
        email_pattern = r"\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b"
        emails = re.findall(email_pattern, driver.page_source)
        
        # 抽出したemailアドレスを出力
        for email in emails:
            after_at = email.split('@', 1)[1]
            if gl_HP.find(after_at) > -1 :
                gl_askEmail=email
                break
    
    gl_address= re.sub('[0-9]{3}-[0-9]{4}','',gl_address) 
    gl_address=gl_address.replace('〒','')
    gl_tel = getTel(removeTagInfo(soup))
    
    if len(gl_address) < 5 : 
        gl_address = getAdd(soup)
        gl_address = cutStr(gl_address)
        #gl_address=modifyAdd(gl_address)
    if len(gl_tel ) > 0 or len(gl_address) > 0 : gl_HPsource=soup
    gl_Money = checkNone(gl_Money)
    gl_president = checkNone(gl_president)
    gl_empNum = checkNone(gl_empNum)
    if len(re.findall(r'\d', gl_empNum)) ==0 :gl_empNum=''
    if len(re.findall(r'\d', gl_Money))  ==0 :gl_Money=''
    gl_address = checkNone(gl_address)
    gl_business = checkNone(gl_business)
    if gl_business == '事業' or gl_business == '事業内容' : gl_business=''
    gl_tel = checkNone(gl_tel)
    
    #print(tel + "," + address + ',' + president +','+ empNum+','+money+','+business)
    #glComData=tel + "," + address + ',' + president +','+ empNum+','+money+','+business


# In[16]:


def getNextTD(text):
    text=text.replace('\t','').replace('\u3000','').replace("<dd><p>",'<dd>').replace("</p></dd>",'</dd>').replace("<td><p>",'<td>').replace("</p></td>",'</td>').replace('<p>&nbsp;</p>','')
    #text=text.replace("<dd><p>",'<dd>').replace("</p></dd>",'</dd>').replace("<td><p>",'<td>').replace("</p></td>",'</td>')
    tdPos = text.find('<td')
    if text.find('<dd') > -1 :
        divPos = text.find('<dd')
        divStr = '<dd'
        divEndStr = '</dd'
    else:
        divPos = text.find('<div')
        divStr = '<div'
        divEndStr = '</div'
    if text.find('<br') > -1 and text.find('<br') < divPos:
        divPos = text.find('<br')
        divStr = '<br'
        divEndStr = ''
    if (text.find('<br') > -1 and text.find('<br') < divPos) or divPos==-1:
        divPos = text.find('<br')
        divStr = ''
        divEndStr = '<br>'
    if (text.find('<p') > -1 and text.find('<p') < divPos) or divPos==-1:
        divPos = text.find('<p')
        divStr = '<p'
        divEndStr = '</p'
    if (text.find('<span') > -1 and text.find('<span') < divPos) or divPos==-1:
        divPos = text.find('<span')
        divStr = '<span'
        divEndStr = '</span'
    if (text.find('<address') > -1 and text.find('<address') < divPos) or divPos==-1:
        divPos = text.find('<address')
        divStr = '<address'
        divEndStr = '</address'
    if divPos == -1 :
        if (text.find('</td') > 3 and text.find('</td') < divPos)   :#or divPos==-1:
            divPos = text.find('</td')
            divStr = ''
            divEndStr = '</td'
        if (text.find('</dd') > 3 and text.find('</dd') < divPos) :# or divPos==-1:
            divPos = text.find('</dd')
            divStr = ''
            divEndStr = '</dd'
        if (text.find('</li') > 3 and text.find('</li') < divPos) :# or divPos==-1:
            divPos = text.find('</li')
            divStr = ''
            divEndStr = '</li'
    if (tdPos > 50 and divPos > 50) or (tdPos > 50 and divPos == -1)  or (tdPos == -1 and divPos > 50) :
        if text.find('>') < text.find('<'):
            divPos=text.find('>')
            divStr = ''
            divEndStr = '>'
        else:
            divPos = text.find('<')
            divStr = ''
            divEndStr = '<'
        tdPos=-1
    
    if tdPos > -1 and divPos > -1:
        if tdPos < divPos: 
            text = text[text.find('<td'):]
            text = text[:text.find('</td')]
            if text.find('>',3) > -1 and len(text) > text.find('>',3) :
                text=text[text.find('>',3)+1:]
            text = text.replace('<td>','')
        else:
            text = text[text.find(divStr):]
            text = text[:text.find(divEndStr)]
            if text.find('>',3) > -1 and len(text) > text.find('>',3) :
                text=text[text.find('>',3)+1:]
            text = text.replace(divStr,'')  
    if tdPos > -1 and divPos == -1:
        text = text[text.find('<td'):]
        text = text[:text.find('</td')]
        if text.find('>',3) > -1 and len(text) > text.find('>',3) :
            text=text[text.find('>',3)+1:]
        text = text.replace('<td>','')
    if tdPos == -1 and divPos > -1:
        text = text[text.find(divStr):]
        text = text[:text.find(divEndStr)]
        if text.find('>',3) > -1 and len(text) > text.find('>',3) :
            text=text[text.find('>',3)+1:]
        text = text.replace(divStr,'')      
    return text


# In[12]:


def getNextBR(text):
    text = text[text.find('<td'):]
    text = text[:text.find('</td')]
    text = text[:text.find('<br>')]
    text = text.replace('<td>','')
    return text


# In[13]:


def getNextB(text):
    text = text[text.find('<b>'):]
    text = text[:text.find('</b>')]
    text = text.replace('<td>','').replace('<b>','')
    return text


# In[14]:


def checkHPHyper(keyword):
    aH=''
    for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[*]/div/div/div[1]/div/div/span/a'):
        aH = i.get_attribute('href')
        outH = i.get_attribute('outerHTML')
        inH = i.get_attribute('innerHTML')
        if inH.find(keyword) > -1:
            break
    return aH


# In[15]:


def excludeWord(tarword):
    rt =-1
    eWords=['(153,153,153','416666667','89978449','598048361','598058618','link','div','div','class=']
    result = tarword in eWords
    if result:
        rt=1
    
    return rt


# In[30]:


def cutEndLine(s):
    rtSTr=''
    rtSTr = s[:s.find('<')]
    return rtSTr


# In[31]:


def CreateWebBrowser():
    global driver
    os.environ["https_proxy"] = "http://www-proxy.jp.oracle.com:80"
    driver = webdriver.Chrome()
    return driver


# In[32]:


def changeName(sor):
    removeWords=['|','／','【','】','🏠','/','(',')','●▲■','「','」','🌲','公式','〜','｜','[',']','×','🏡']
    newWords = sor
    for i in removeWords:
        newWords = newWords.replace(i,' ') 
    return newWords


# In[40]:


def companyInfoGoogle(comName,mode='ask'):
    flg=-1
    rt=''
    global driver
    global gl_askPage
    cmpHP=''
    if mode=='ask':
        googleSearch(comName + '　問い合わせ', 'CompanyName', 'HP','onlySearch')
        for i in driver.find_elements(By.TAG_NAME,'a'):
            inHTML = i.get_attribute('innerHTML')
            inURL = i.get_attribute('href')
            if comName.find('http') > -1: cmpHP = comName[comName.find('http'):]
            if inHTML.find('問い合わせ') > -1 and inURL.find(cmpHP) > -1:
                #i.click()
                if i.get_attribute('href').find(gl_HP) >  -1 and i.get_attribute('href').find('pdf') == -1 :
                    rt=i.get_attribute('href')
                    if contactPageValidCheck(gl_HP,rt) ==1:
                        gl_askPage=contactPageValidCheck(gl_HP,rt)
                        flg=1
                        break;
            elif inHTML.find('問合わせ') > -1 and inURL.find(cmpHP) > -1:
                #i.click();
                if i.get_attribute('href').find(gl_HP) >  -1 and i.get_attribute('href').find('pdf') == -1 :                
                    rt=i.get_attribute('href')
                    if contactPageValidCheck(gl_HP,rt) ==1:
                        gl_askPage=contactPageValidCheck(gl_HP,rt)
                        flg=1
                        break;
            elif inHTML.upper().find('CONTACT') > -1 and inURL.find(cmpHP) > -1:
                #i.click();
                if i.get_attribute('href').find(gl_HP) >  -1 and i.get_attribute('href').find('pdf') == -1 :
                    rt=i.get_attribute('href')
                    if contactPageValidCheck(gl_HP,rt) ==1:
                        gl_askPage=contactPageValidCheck(gl_HP,rt)
                        flg=1
                        break;                    
            #if exhibitURLCheck(rt) == '': rt=''
        if len(rt) < 2:
            googleSearch(comName + '　問い合わせ', 'CompanyName', 'HP', 'onlySearch')
            rt = checkHPHyper('問い合わせ')
            if len(rt) < 2:
                if contactPageValidCheck(gl_HP,rt) ==1 or i.get_attribute('href').find('pdf') > -1 :
                    rt=''
                else:
                    gl_askPage=contactPageValidCheck(gl_HP,rt)
        if exhibitURLCheck(rt) == '': rt=''
            
    if mode=='money':
        googleSearch(comName + '　資本金', 'CompanyName', 'HP','onlySearch')
        rt=extractValue('資本金')
        rt=rt.replace(':','').replace('.','')
        if rt.find('円') == -1 and rt.find('0') == -1 :
            rt=''
        elif rt.find('円') > -1:
            rt=rt[:rt.find('円')+1]
        
        #円或いは０で終わる
    if mode=='employee':
        googleSearch(comName + '　従業員数', 'CompanyName', 'HP', 'onlySearch')
        try:
            rt=extractValue('従業員数')
        except:
            rt=''
        if rt=='':        
            googleSearch(comName + '　従業員', 'CompanyName', 'HP', 'onlySearch')
            rt=extractValue('従業員')
        if rt=='':
            googleSearch(comName + '　社員数', 'CompanyName', 'HP', 'onlySearch')
            rt=extractValue('社員数')
            if rt=='':
                rt=extractValue('従業員')
        rt= rt.replace('数','').replace(',','').replace('.','')
        if rt.find('名') > -1 :      rt=rt[:rt.find('名') + 1]
        if rt.find('人') > -1 :      rt=rt[:rt.find('人') + 1]
        rt = rt.lstrip().rstrip()

    if mode=='president':
        googleSearch(comName + '　代表取締', 'CompanyName', 'HP', 'onlySearch')
        rt=extractValue('代表取締','minimum')
        if rt=='':
            googleSearch(comName + '　代表者', 'CompanyName', 'HP', 'onlySearch')
            rt=extractValue('代表者','minimum')
        if rt=='':
            googleSearch(comName + '　社長', 'CompanyName', 'HP', 'onlySearch')
            rt=extractValue('社長','minimum')
            if rt=='':
                rt=extractValue('代表者','minimum')
            if rt=='':
                rt=extractValue('代表取締','minimum')
        if rt=='':
            googleSearch(comName + '　代表取締', 'CompanyName', 'HP', 'onlySearch')
            rt=extractValue('代表取締','all')
            if rt=='':
                googleSearch(comName + '　代表者', 'CompanyName', 'HP', 'onlySearch')
                rt=extractValue('代表者','all')
            if rt=='':
                googleSearch(comName + '　社長', 'CompanyName', 'HP', 'onlySearch')
                rt=extractValue('社長','all')
                if rt=='':
                    rt=extractValue('代表者','all')
                if rt=='':
                    rt=extractValue('代表取締','all')
        
        rt=checkName(rt)
        rt = modifyAdd(rt)
        rt=rt.replace('代表者','').replace('会長','').replace('代表','').replace('取締役','').replace('取締','').replace('役割','').replace('役','').replace('氏','').replace('代表取締','').replace('代表取締','').replace(',','').replace('社長','').replace('.','')
        rt= rt.lstrip().rstrip()
    if mode=='content':
        googleSearch(comName + '　事業内容', 'CompanyName', 'HP', 'onlySearch')
        rt=companyContent()
        if rt =='':
            googleSearch(comName + '　業種', 'CompanyName', 'HP', 'onlySearch')
            rt=companyContent()
        if rt =='':
            googleSearch(comName + '　事業形態', 'CompanyName', 'HP', 'onlySearch')
            rt=companyContent()
        rt.replace('  ',' ')
    rt=rt.replace('\n',' ')
        
    return rt


# In[52]:


def defaultGoogleInfo():
    global gl_Money
    global gl_president
    global gl_empNum
    global gl_address
    global gl_business
    global gl_tel
    global gl_buyFlg
    global gl_HP
    global gl_Com
    global gl_HPsource
    findFlg = -1
    setHPsource = -1 
    rt=''
    wantInfo=['従業員','資本金','TEL','電話','本社所在地','本社住所','住所','所在地','本社','本店','本部','事業内容','事業形態']
    if gl_HPsource=='' : setHPsource = 1 

    for j in driver.find_elements(By.TAG_NAME, 'div'):
        try:
            if j.get_attribute('CLASS') == "Crs1tb" :
                subDriver = j
                if gl_HP == '':
                    for i in subDriver.find_elements(By.TAG_NAME, 'a'):
                        if i.get_attribute('href').find('http')> -1:
                            rt = i.get_attribute('href')            
                            rt = getHPURL(rt)
                            if len(rt) > 5 : 
                                rt=rt[:rt.find("/",9)]
                                gl_HP = rt
                            else:
                                gl_HP = ''
                                findFlg = -1
                                break
                for i in subDriver.find_elements(By.TAG_NAME, 'tr'):
                    for k in wantInfo:
                        tarStr = k
                        if i.get_attribute('innerHTML').replace(' ','').find(tarStr)> -1:
                            findData = i.get_attribute('innerHTML').replace(' ','')
                            findData = findData[findData.find(tarStr)+len(tarStr):]
                            findData = getNextTD(findData)
                            rt=removeTagInfo(findData)
                            rt= rt.replace('\n','').lstrip().rstrip()
                            if setHPsource==1 or (gl_HPsource.find(k) == -1 and rt!='' ): 
                                gl_HPsource=gl_HPsource+i.get_attribute('innerHTML')
                            if rt != '' and k.replace(' ','') == '従業員' and  gl_empNum == '' and gl_HPsource.find(k) > -1 and len(re.findall(r'\d+', rt)) >0:  gl_empNum=rt
                            if rt != '' and k.replace(' ','') == '資本金' and gl_Money == ''   and gl_HPsource.find(k) > -1  and len(re.findall(r'\d+', rt)) >0: gl_Money=rt
                            if rt != '' and (k.replace(' ','') == '電話' or k.replace(' ','') == 'TEL') and gl_tel == '':  gl_tel=rt
                            if rt != '' and (k.replace(' ','') == '住所' or k.replace(' ','') == '所在地' or k.replace(' ','')=='本社所在地' or k.replace(' ','')=='本社住所' or k.replace(' ','')=='本社' or k.replace(' ','')=='本店' or k.replace(' ','')=='本部') and gl_address=='': 
                                gl_address=rt
                                #gl_address = modifyAdd(gl_address)
                                gl_address = getAdd(gl_address)
                                gl_address = cutStr(gl_address)
                            if rt != '' and gl_business=='' and k == '事業内容' or k == '事業形態': gl_business=rt
                            findFlg = 1
                break                            
        except:
            pass

    
    if len(gl_HP) < 5 :gl_HP=''
    if len(gl_empNum) < 1 : 
        findFlg=-1
        gl_empNum=''
    if len(gl_Money) < 2: 
        findFlg=-1
        gl_Money=''
    return findFlg             


# In[119]:


def extractValue(tarStr,mode='all'):
    rt=''
    loopExit=-1
    if rt =='' and (tarStr.find('内容') > -1  or tarStr.find('内容') > -1):
        for i in driver.find_elements(By.TAG_NAME, 'span'):
            if i.get_attribute('CLASS') == "hgKElc" :
                findData = i.get_attribute('innerHTML')
                if findData.find(tarStr) > 0:
                    findData = getNextB(findData)
    
                    rt=removeTagInfo(findData)
                    rt= rt.replace('\n','').lstrip().rstrip()
                    break        
    if rt =='':
        for j in driver.find_elements(By.TAG_NAME, 'div'):
            try:
                if j.get_attribute('CLASS') == "Crs1tb" :
                    subDriver = j
                    for i in subDriver.find_elements(By.TAG_NAME, 'tr'):
                        if i.get_attribute('innerHTML').find(tarStr)> -1:
                            findData = i.get_attribute('innerHTML')
                            findData = findData[findData.find(tarStr)+len(tarStr):]
                            findData = getNextTD(findData)
                            rt=removeTagInfo(findData)
                            rt= rt.replace('\n','').lstrip().rstrip()
                            loopExit=1
                            break
            except:
                rt=''
            if loopExit== 1 : break
    if mode=='all':                
        if rt =='':
            for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[*]/div/div/div/div[2]/div/span'):
                if i.get_attribute('innerHTML').find(tarStr)> -1 and i.get_attribute('outerHTML').find(gl_HP) > -1:
                    findData = i.get_attribute('innerHTML')
                    findData = i.get_attribute('innerHTML')
                    findData = findData[findData.find(tarStr)+len(tarStr):]
                    findData = getNextTD(findData)
                    rt=removeTagInfo(findData)
                    rt= rt.replace('\n','').lstrip().rstrip()
                    break
        if rt =='':
            for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[3]/div/div/div[2]/div/span'):
                if i.get_attribute('innerHTML').find(tarStr)> -1 and i.get_attribute('outerHTML').find(gl_HP) > -1:
                    findData = i.get_attribute('innerHTML')
                    findData = i.get_attribute('innerHTML')
                    findData = findData[findData.find(tarStr)+len(tarStr):]
                    findData = getNextTD(findData)
                    rt=removeTagInfo(findData)
                    rt= rt.replace('\n','').lstrip().rstrip()
                    break
        if rt =='':
            for j in driver.find_elements(By.TAG_NAME, 'div'):
                if j.get_attribute('CLASS') == "VwiC3b yXK7lf lVm3ye r025kc hJNv6b Hdw6tb" :
                    subDriver = j
                    for i in subDriver.find_elements(By.TAG_NAME, 'span'):
                        if i.get_attribute('innerHTML').find(tarStr)> -1:
                            findData = i.get_attribute('innerHTML')
                            findData = findData[findData.find(tarStr)+len(tarStr):]
                            rt=removeTagInfo(findData)
                            rt= rt.replace('\n','').lstrip().rstrip()
                            loopExit= 1
                            break
                if loopExit== 1 : break
    return rt


# In[2]:


def checkGoogleHP(mode='all'):
    rt=''
    for i in driver.find_elements(By.TAG_NAME, "A"):
        if len(i.get_attribute('outerHTML')) > 3:
            if (i.get_attribute('innerHTML').find('Website') > -1  or i.get_attribute('innerHTML').find('>Website<') > -1 ) and i.get_attribute('CLASS')=='ab_button':
                rt = i.get_attribute('href')
                if rt == '':
                    rt = i.get_attribute('outerHTML')
                    rt=rt[rt.find('url='):]
                    if rt.find('https://') > -1 and rt.replace('https://','').find('/') > -1:
                        tempRt = rt.replace('https://','')
                        tempRt=tempRt[:tempRt.find("/")]
                        if rt.find('https://') > -1:
                            rt='https://' + tempRt
                        else:
                            rt=tempRt                    
                    rt=getHPURL(rt)
                if exhibitURLCheck(rt) != '':
                    break
                else:
                    rt=''
            if (i.get_attribute('innerHTML').find('ウェブサイト')>-1  or i.get_attribute('innerHTML').find('>Website<') > -1 )  and i.get_attribute('CLASS')=='ab_button' :
                rt = i.get_attribute('href')
                if rt == '':
                    rt = i.get_attribute('outerHTML')
                    rt=rt[rt.find('url='):]
                    if rt.find('https://') > -1 and rt.replace('https://','').find('/') > -1:
                        tempRt = rt.replace('https://','')
                        tempRt=tempRt[:tempRt.find("/")]
                        if rt.find('https://') > -1:
                            rt='https://' + tempRt
                        else:
                            rt=tempRt
                    rt=getHPURL(rt)
                if exhibitURLCheck(rt) != '':
                    break
                else:
                    rt=''
    

    if rt=='':
        for i in driver.find_elements(By.TAG_NAME, "DIV"):
            if mode=='all':
                if (i.get_attribute('CLASS')=="hlcw0c" or i.get_attribute('CLASS')=="MjjYud")  :
                    for j in i.find_elements(By.TAG_NAME,('a')):
                        rt=j.get_attribute('href')
                        if rt.find('https://') > -1 and rt.replace('https://','').find('/') > -1:
                            tempRt = rt.replace('https://','')
                            tempRt=tempRt[:tempRt.find("/")]
                            if rt.find('https://') > -1:
                                rt='https://' + tempRt
                            else:
                                rt=tempRt
                        rt= getHPURL(j.get_attribute('href'))
                        if rt !='':
                            if exhibitURLCheck(rt) != '':
                                break
                            else:
                                rt=''
            else:
                if  i.get_attribute('CLASS')=="MjjYud"  :
                    for j in i.find_elements(By.TAG_NAME,('a')):
                        rt=j.get_attribute('href')
                        if rt.find('https://') > -1 and rt.replace('https://','').find('/') > -1:
                            tempRt = rt.replace('https://','')
                            tempRt=tempRt[:tempRt.find("/")]
                            if rt.find('https://') > -1:
                                rt='https://' + tempRt
                            else:
                                rt=tempRt
                        rt= getHPURL(j.get_attribute('href'))
                        if rt !='':
                            if exhibitURLCheck(rt) != '':
                                break
                            else:
                                rt=''  
            if rt!='':break                                
#    if rt=='':
#        for i in driver.find_elements(By.TAG_NAME, "DIV"):
#            if i.get_attribute('CLASS')=="MjjYud"  and i.get_attribute('outerHTML').find('github.com') == -1  and i.get_attribute('outerHTML').find('nstagram.com') == -1:
#                rt= getHPURL(i.get_attribute('innerHTML'))
##                if rt !='':
 #                   break
    cnt = 0
    if rt=='':
        for i in driver.find_elements(By.TAG_NAME, "DIV"):
            if i.get_attribute('CLASS')=="g Ww4FFb vt6azd tF2Cxc asEBEc"  :
                rt= getHPURL(i.get_attribute('innerHTML'))
                if rt !='':
                    if exhibitURLCheck(rt) != '':
                        break
                    else:
                        rt=''
            cnt = cnt + 1
            if cnt > 5:
                break
    rt = cutStr(rt)
    #if  mode == 'all'  and len(rt) > 9:  rt=rt[:rt.find("/",9)]
    if rt.find('https://') > -1 and rt.replace('https://','').find('/') > -1:
        tempRt = rt.replace('https://','')
        tempRt=tempRt[:tempRt.find("/")]
        if rt.find('https://') > -1:
            rt='https://' + tempRt
        else:
            rt=tempRt
    elif rt.find('http://') > -1 and rt.replace('http://','').find('/') > -1:             
        tempRt = rt.replace('http://','')
        tempRt=tempRt[:tempRt.find("/")]
        if rt.find('http://') > -1:
            rt='http://' + tempRt
        else:
            rt=tempRt
    return rt
 


# In[38]:


def destroyWebBrowser():
    global driver
    driver.close()


# In[12]:


def refreshBrowse(url):
    global driver
    #if url.find('https://') == -1 and url.find('http://') == -1 : url= 'https://'+url
    if url.find('@') > -1 : return driver
    try:
        driver.get(url)
    except:
        print('Error : URLが正しくありません : '+ url)
    #print(url)
    #time.sleep(5)
    #wait = WebDriverWait(driver, 10)  # 最大10秒間待機します（必要に応じて変更してください）
    driver.implicitly_wait(10)
    #wait.until(EC.url_to_be(url))
    if driver.page_source.find('お使いのコンピュータ ネットワークから通常と異なるトラフィックが検出されました。') > -1: input('ロボットメッセージ対応')
    return driver


# In[40]:


def checkNone(sor):
    if sor is None:
        rt = ''
    else:
        rt=sor
    return rt


# In[65]:


def cutStr(orgStr, mode='all'):
    rtStr = orgStr
    if rtStr[:4] == 'em>は' : rtStr = rtStr[4:]
    if rtStr[:3] == 'em>' : rtStr = rtStr[3:]
    rtStr = rtStr.replace('会社情報 ','').replace('会社情報','').replace('公式サイト','')
    if rtStr.find('<') > -1:
        rtStr = rtStr[0:rtStr.find('<')]
    if rtStr.find('>') > -1:
        rtStr = rtStr[0:rtStr.find('>')]
    if rtStr.find('&amp') > -1:
        rtStr = rtStr[0:rtStr.find('&amp')]
    if mode == 'all': 
        if rtStr.find(' ') > -1:
            rtStr = orgStr[0:orgStr.find(' ')]
            if len(rtStr) < 3:
                rtStr = orgStr[orgStr.find(' '):]
                if len(rtStr) < 3:
                    rtStr = orgStr.replace(' ','')

    rtStr = rtStr.replace('/em','').replace('ac-link','').replace('link-arrow','').replace('boxhref','').replace('fl_1&','').replace('n_1','').replace('--;','').replace('●','')
    rtStr = rtStr.replace('&amp','').replace('&lt;','').replace('&gt;','').replace('gt;','')
    rtStr = rtStr.replace('\n','').replace('url=','').replace('"','').replace('&nbsp;','').replace(';','')

    return rtStr


# In[42]:


def fWrite(str,fName):
    data_file =fName
    with open(data_file, 'a', errors="ignore", encoding="utf-8") as html_file:
    #with open(data_file, 'a', errors="ignore", encoding='shift_jis') as html_file:
    
        html_file.write(str)   


# In[35]:


def getTel(s,mode='Normal'):
    import re
    rt=''
    s=s.upper().replace('FAX','')
    if s.find('電話') > -1:
        s = s[s.find('電話'):]
    elif s.upper().find('TEL') > -1:
        s = s[s.upper().find('TEL') :]
    elif s.upper().find('代表番号') > -1:
        s = s[s.upper().find('代表番号') :]        
    #if s.upper().find('FAX') > -1: s = s[:s.upper().find('FAX')]
    #pattern = r'[(]?\d{1,4}[-),－)]?\d{2,4}[-,－]\d{4}'
    pattern = r'[(,（]?\d{1,4}[-),－2[),）]]?\d{2,4}[-,－]\d{4}'
    res = re.findall(pattern, s)     
    if len(res)!=0 :
        for i in res:
            if excludeWord(i)==-1 and len(i.replace('-',''))>8   and i.find('-')!=-1 and i.find(',')==-1  and i[0:4]!='0120'   and i[0:4]!='0080'  and i[0:3]!='080'  and i[0:3]!='090':
                tempRt = i.replace('(','').replace(')','-')  
                if tempRt[0:1]=="0" or tempRt[0:2]=="81" or tempRt[0:3]=="+81" :
                    rt=tempRt
                    break;
    
    if rt=='':
        pattern = r'\d{10,12}'
        res = re.findall(pattern, s)       
        if len(res)!=0 :
            for i in res:
                if excludeWord(i)==-1:
                    tempRt = i.replace('(','').replace(')','-')  
                    if tempRt[0:1]=="0" or tempRt[0:2]=="81" or tempRt[0:3]=="+81" :
                        rt=tempRt
                        break;
    rt=rt.replace(':','').replace('.','').replace(' ','').replace('TEL','').replace(':','')
    rt = modifyAdd(rt)
    if len(rt.replace('-',''))<8 or len(rt) > 14 or len(re.findall(r'\d', s))< 8 :
        rt=''
        
    return rt


# In[44]:


def checkTel(comName):
    keyWord = comName + " " + "電話番号"
    url ="https://www.google.co.jp/search?q=" + keyWord
    refreshBrowse(url)

    
    tel=''
    for i in driver.find_elements(By.TAG_NAME, "TD"):
        if len(i.get_attribute('innerHTML')) > 3:
            tel =getTel(i.get_attribute('innerHTML'))
            if tel!='':
                break
    if tel =='':
        for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div[*]/div/span'):
            if len(i.get_attribute('innerHTML')) > 3:
                tel =getTel(i.get_attribute('innerHTML'))
                if tel!='':
                    break
    if tel =='':
        for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div[*]/div'):
            if len(i.get_attribute('innerHTML')) > 3:
                tel =getTel(i.get_attribute('innerHTML'))
                if tel!='':
                    break
    if tel =='':
        for i in driver.find_elements(By.TAG_NAME, "SPAN"):
            if len(i.get_attribute('innerHTML')) > 3:
                tel =getTel(i.get_attribute('innerHTML'))
                if tel!='':
                    break
    return tel


# In[45]:


def getHPURL(s,mode='Normal'):
    import re
    rt=''
    s=s.replace("'",'').replace('"','')
    pattern = 'http[s]://.*[\w].[\w]+'
    res = re.findall(pattern, s)     
    if len(res)!=0 :
        for i in res:
            
            if i.find('.') > -1 and excludeWord(i)==-1 and i.find('github.com') == -1  and i.find('nstagram.com') == -1 and i.find('mynavi.jp') == -1 and i.find('translate.google.com') == -1  and i.find('facebook') == -1  and i.find('twitter.com') == -1 and i.find('job-gear.net') == -1  and i.find('senken.co.jp') == -1  and i.find('nikkei.com') == -1   and i.find('arc-navi') == -1  and i.find('doda.co.jp') == -1   and i.find('indeed.com') == -1  and i.find('koyou.pref.shizuoka.jp') == -1   :
                if exhibitURLCheck(i) != '':                
                    rt=i
                    break;
    if rt=='':
        pattern = 'http://.*[\w].[\w]+'
        res = re.findall(pattern, s)     
        if len(res)!=0 :
            for i in res:
                if i.find('.') > -1 and excludeWord(i)==-1 and i.find('github.com') == -1  and i.find('nstagram.com') == -1 and i.find('mynavi.jp') == -1 and i.find('translate.google.com') == -1  and i.find('facebook') == -1  and i.find('twitter.com') == -1 and i.find('job-gear.net') == -1  and i.find('senken.co.jp') == -1   and i.find('nikkei.com') == -1  and i.find('arc-navi') == -1  and i.find('doda.co.jp') == -1  and i.find('indeed.com') == -1  and i.find('koyou.pref.shizuoka.jp') == -1   :
                    if exhibitURLCheck(i) != '':    
                        rt=i
                        break;
        
    if rt=='':
        pattern = '[\w/:%#$&\?\(\)~\.=\+\-]+'
        res = re.findall(pattern, s)     
        if len(res)!=0 :
            for i in res:
                if i.find('.') > -1 and excludeWord(i)==-1 and i.find('github.com') == -1  and i.find('nstagram.com') == -1 and i.find('mynavi.jp') == -1 and i.find('translate.google.com') == -1  and i.find('facebook') == -1  and i.find('twitter.com') == -1 and i.find('job-gear.net') == -1  and i.find('senken.co.jp') == -1   and i.find('nikkei.com') == -1   and i.find('arc-navi') == -1   and i.find('doda.co.jp') == -1  and i.find('indeed.com') == -1  and i.find('koyou.pref.shizuoka.jp') == -1   :
                    if exhibitURLCheck(i) != '':    
                        rt=i
                        break;
    if rt[0:4] !='http' : rt = ''
    if rt == 'xmlns=http:' : rt=''
    if rt !='':
        rt=cutStr(rt)
    return rt


# In[49]:


def removeTagInfo(s):
    startflg = -1
    endflg = -1
    s=s.lstrip().rstrip()
    s=s.replace('\t','')
    curLine=0
    s=s.replace('image-blockright=','').replace('image-blockright','').replace('-blockright','').replace('class=','').replace('image=','').replace('text=','').replace('image','').replace('text','')
    s= s.replace('&nbsp;',' ').replace('</em>','').replace('·','').replace('· ','').replace('/em','').replace('&lt;','').replace('div','')
    s=s.replace('&lt;','').replace('&gt;','').replace('"','').replace('\n','')
    soup = BeautifulSoup(s, "html.parser")
    #for script in soup.find_all("script"):
    #    script.get_text()
    #s = soup.prettify()    
    s=soup.get_text()
    prcStr = s
    for i in range(len(s)):
        
        if s[curLine:curLine+1] == '<':
            startflg = curLine
        if startflg > -1 and s[curLine:curLine+1] == '>':
            removeStr = s[startflg:curLine+1]
            prcStr = prcStr.replace(removeStr,( ' '))
            startflg=-1
        curLine=curLine+1
    if startflg != -1:
        removeStr = s[startflg:]
        prcStr = prcStr.replace(removeStr,( ' '))
    prcStr=prcStr.replace('\n','')
    return prcStr


# In[47]:


def cutEndLine(s):
    rtSTr=''
    rtSTr = s[:s.find('<')]
    return rtSTr


# In[15]:


def checkGoogleComName(comName):
    rt=''
    for i in driver.find_elements(By.TAG_NAME, "span"):
        if i.get_attribute('CLASS') :
            if i.get_attribute('CLASS').find('VuuXrf')>-1:
                rt=i.get_attribute('innerHTML')
                if rt !='':
#                if diffPercentage(comName.replace("株式会社",""),rt.replace("株式会社","")) > 0.6:
                    rt= rt.replace('<span>','').replace('</span>','')
                    break
    if     rt=='' or rt.find('.co') > -1:
        for i in driver.find_elements(By.TAG_NAME, "H2"):
            if i.get_attribute('CLASS') :
                if i.get_attribute('CLASS').find('qrShPb pXs6bb')>-1:
                    rt=i.get_attribute('innerHTML')
                    if rt !='':
#                    if diffPercentage(comName.replace("株式会社",""),rt.replace("株式会社","")) > 0.6:
                        rt= rt.replace('<span>','').replace('</span>','')
                        break
    if     rt=='' or rt.find('.co') > -1:     
        for i in driver.find_elements(By.TAG_NAME, "H3"):
            if i.get_attribute('CLASS') :
                if i.get_attribute('CLASS').find('LC20lb MBeuO DKV0Md')>-1:
                    rt=i.get_attribute('innerHTML')
                    if rt !='':
#                    if diffPercentage(comName.replace("株式会社",""),rt.replace("株式会社","")) > 0.6:
                        rt= rt.replace('<span>','').replace('</span>','')
                        break
    if rt == '' or rt.find('.co') > -1:
        for i in driver.find_elements(By.TAG_NAME, "div"):
            if i.get_attribute('CLASS') :
                if i.get_attribute('CLASS').find('PZPZlf ssJ7i B5dxMb')>-1:
                    rt=i.get_attribute('innerHTML')
                    if rt !='':
#                    if diffPercentage(comName.replace("株式会社",""),rt.replace("株式会社","")) > 0.6:
                        rt= removeTagInfo(rt)
                        break
    
    if     rt=='':            
        if driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div/div/div/div/div/div[1]/div/span/a/div/div/span'):
            rt=driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div/div/div/div/div/div[1]/div/span/a/div/div/span')[0].get_attribute('innerHTML')
#           if diffPercentage(comName.replace("株式会社",""),rt.replace("株式会社","")) > 0.6:
#                rt=rt
#            else :
#                rt=''
#    rt = cutStr(rt)
    rt.replace('本社','').replace('本店','').replace('本部','')
    rt=comNameAlphabetCnt(comName, rt)
    return rt
 


# In[ ]:


def comNameAlphabetCnt(sorName, tarName):
    sorCnt = len(re.findall(r'[a-zA-Z]', sorName))
    tarCnt = len(re.findall(r'[a-zA-Z]', tarName))
    if tarCnt > sorCnt : tarName='★'+tarName
    return tarName


# In[60]:


def checkGoogleAdd():
    rt=''
    loopExit= -1

    if rt=='':
        for i in driver.find_elements(By.TAG_NAME, "DIV"):
            try:
                if i.get_attribute('CLASS'):
                    if i.get_attribute('CLASS')=="sXLaOe"  :
                        if i.get_attribute('outerHTML') :
                            if i.get_attribute('outerHTML').find('github.com') == -1  and i.get_attribute('outerHTML').find('nstagram.com') == -1 and i.get_attribute('outerHTML').find('job-gear.net') == -1 and i.get_attribute('outerHTML').find('senken.co.jp') == -1   and i.get_attribute('outerHTML').find('nikkei.com') == -1   and i.get_attribute('outerHTML').find('nikkei.com') == -1  and i.get_attribute('outerHTML').find('arc-navi') == -1  and i.get_attribute('outerHTML').find('doda.co.jp') == -1  and i.get_attribute('outerHTML').find('indeed.com') == -1   and i.get_attribute('outerHTML').find('koyou.pref.shizuoka.jp') == -1 :
                                rt= getAdd(i.get_attribute('innerHTML'))
                                if rt !='' and findAddStr(rt) !='':
                                    break                
            except:
                pass
    #print('rt1 : ' + rt)
    if rt =='':
        for j in driver.find_elements(By.TAG_NAME, 'div'):
            if j.get_attribute('CLASS'):
                if j.get_attribute('CLASS') == "Crs1tb" :
                    subDriver = j
                    for i in subDriver.find_elements(By.TAG_NAME, 'tr'):
                        if i.get_attribute('innerHTML').find('住所')> -1 or i.get_attribute('innerHTML').find('所在地')> -1 or i.get_attribute('innerHTML').find('本社所在地')> -1  or i.get_attribute('innerHTML').find('本社住所')> -1   or i.get_attribute('innerHTML').find('本社')> -1    or i.get_attribute('innerHTML').find('本店')> -1:
                            findData = i.get_attribute('innerHTML')
                            if findData.find('本社所在地') > -1 : findData = findData[findData.find('本社所在地')+len('本社所在地'):]
                            if findData.find('本社住所') > -1 : findData = findData[findData.find('本社住所')+len('本社住所'):]
                            if findData.find('住所') > -1 : findData = findData[findData.find('住所')+len('住所'):]
                            if findData.find('所在地') > -1 : findData = findData[findData.find('所在地')+len('所在地'):]
                            if findData.find('本社') > -1 : findData = findData[findData.find('本社')+len('本社'):]
                            if findData.find('本店') > -1 : findData = findData[findData.find('本店')+len('本店'):]
                            if findData.find('本部') > -1 : findData = findData[findData.find('本部')+len('本部'):]
                            rt = getAdd(findData)
                            rt= rt.replace('\n','').lstrip().rstrip()
                            if rt !='' and findAddStr(rt) !='':
                                loopExit=1
                                break
            if loopExit== 1 : break
    #print('rt2 : ' + rt)
    if rt=='':
        if driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div/div/div/div/div[1]/div/div[1]'):
            rt = driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div/div/div/div/div[1]/div/div[1]')[0].get_attribute('innerHTML')
            rt=getAdd(rt)
    if rt=='':
        for j in driver.find_elements(By.TAG_NAME, 'div'):
            if j.get_attribute('CLASS'):
                if j.get_attribute('CLASS') == "VwiC3b yXK7lf lVm3ye r025kc hJNv6b Hdw6tb" :
                    subDriver = j
                    for i in subDriver.find_elements(By.TAG_NAME, 'span'):
                        if i.get_attribute('innerHTML').find('住所')> -1 or i.get_attribute('innerHTML').find('所在地')> -1 or i.get_attribute('innerHTML').find('本社所在地')> -1  or i.get_attribute('innerHTML').find('本社住所')> -1   or i.get_attribute('innerHTML').find('本社')> -1    or i.get_attribute('innerHTML').find('本店')> -1:
                            findData = i.get_attribute('innerHTML')
                            if findData.find('本社所在地') > -1 : findData = findData[findData.find('本社所在地')+len('本社所在地'):]
                            if findData.find('本社住所') > -1 : findData = findData[findData.find('本社住所')+len('本社住所'):]
                            if findData.find('住所') > -1 : findData = findData[findData.find('住所')+len('住所'):]
                            if findData.find('所在地') > -1 : findData = findData[findData.find('所在地')+len('所在地'):]
                            if findData.find('本社') > -1 : findData = findData[findData.find('本社')+len('本社'):]
                            if findData.find('本店') > -1 : findData = findData[findData.find('本店')+len('本店'):]
                            if findData.find('本部') > -1 : findData = findData[findData.find('本部')+len('本部'):]
                            rt = getAdd(findData)
                            if rt !='' and findAddStr(rt) !='':
                                loopExit= 1
                                break
            if loopExit== 1 : break
    #print('rt3 : ' + rt)
    if rt=='':
        for i in driver.find_elements(By.TAG_NAME, "DIV"):
            if i.get_attribute('CLASS'):
                if i.get_attribute('CLASS')=="hlcw0c"  :
                    if i.get_attribute('outerHTML'):
                        if i.get_attribute('outerHTML').find('github.com') == -1  and i.get_attribute('outerHTML').find('nstagram.com') == -1 and i.get_attribute('outerHTML').find('job-gear.net') == -1  and i.get_attribute('outerHTML').find('senken.co.jp') == -1  and i.get_attribute('outerHTML').find('nikkei.com') == -1  and i.get_attribute('outerHTML').find('arc-navi') == -1   and i.get_attribute('outerHTML').find('doda.co.jp') == -1  and i.get_attribute('outerHTML').find('indeed.com') == -1  and i.get_attribute('outerHTML').find('koyou.pref.shizuoka.jp') == -1 :
                            rt= getAdd(i.get_attribute('innerHTML'))
                            if rt !='' and findAddStr(rt) !='':
                                break
        #print('rt4 : ' + rt)
    if rt=='':
        for i in driver.find_elements(By.TAG_NAME, "DIV"):
            if i.get_attribute('CLASS'):
                if i.get_attribute('CLASS')=="MjjYud" :
                    if i.get_attribute('outerHTML') :
                        if i.get_attribute('outerHTML').find('github.com') == -1  and i.get_attribute('outerHTML').find('nstagram.com') == -1 and i.get_attribute('outerHTML').find('job-gear.net') == -1 and i.get_attribute('outerHTML').find('senken.co.jp') == -1 and i.get_attribute('outerHTML').find('nikkei.com') == -1  and i.get_attribute('outerHTML').find('arc-navi') == -1   and i.get_attribute('outerHTML').find('doda.co.jp') == -1  and i.get_attribute('outerHTML').find('indeed.com') == -1  and i.get_attribute('outerHTML').find('koyou.pref.shizuoka.jp') == -1 :
                            rt= getAdd(i.get_attribute('innerHTML'))
                            if rt !='' and findAddStr(rt) !='':
                                break
    #print('rt5 : ' + rt)
    if rt=='':
        for i in driver.find_elements(By.TAG_NAME, "DIV"):
            if i.get_attribute('CLASS'):
                if i.get_attribute('CLASS')=="g Ww4FFb vt6azd tF2Cxc asEBEc"  :
                    if i.get_attribute('outerHTML'):
                        if i.get_attribute('outerHTML').find('github.com') == -1  and i.get_attribute('outerHTML').find('nstagram.com') == -1 and i.get_attribute('outerHTML').find('job-gear.net') == -1 and i.get_attribute('outerHTML').find('senken.co.jp') == -1 and i.get_attribute('outerHTML').find('nikkei.com') == -1   and i.get_attribute('outerHTML').find('arc-navi') == -1   and i.get_attribute('outerHTML').find('doda.co.jp') == -1   and i.get_attribute('outerHTML').find('indeed.com') == -1  and i.get_attribute('outerHTML').find('koyou.pref.shizuoka.jp') == -1 :
                            rt= getAdd(i.get_attribute('innerHTML'))
                            if rt !='' and findAddStr(rt) !='':
                                break    
    #print('rt6 : ' + rt)
    rt = modifyAdd(rt)
    rt = removeTagInfo(cutStr(rt))
    return rt
 


# In[61]:


def googleSearch(searchStr,keyword="CompanyName", result="HP", mode='all'):
    rt=""
    searchStr=searchStr.replace("\n","").replace('"','')
    keyWord = searchStr 
    if keyword=="CompanyName" and  result=="Tel":
        rt = googleSearchTel(searchStr)
    if keyword=="CompanyName" and  result=="HP":
        rt = googleSearchCH(searchStr,mode)
    if keyword=="CompanyName" and  result=="CompanyName":
        rt = googleSearchGetComName(searchStr)
    if keyword=="CompanyName" and  result=="Address":
        rt = googleSearchAddress(searchStr)
    if keyword=="HP" and  result=="CompanyName":
        rt = googleSearchAddress(searchStr)
    if keyword=="CompanyName" and  result=="Default":
        rt = googleSearchDefaultData(searchStr)
    return rt


# In[62]:


def googleSearchDefaultData(comName,mode='all'):
    comName=comName.replace("\n","").replace('"','')
    keyWord = comName + ' 従業員' 
    if len (keyWord ) > 2:
        url ="https://www.google.co.jp/search?q=" + keyWord
        refreshBrowse(url)
        rt = defaultGoogleInfo()
        if rt == -1:
            keyWord = comName + ' 資本金' 
            url ="https://www.google.co.jp/search?q=" + keyWord
            refreshBrowse(url)
            rt = defaultGoogleInfo()

    return ''


# In[63]:


def googleSearchCH(comName,mode='all'):
    comName=comName.replace("\n","").replace('"','')
    keyWord = comName 
    if len (keyWord ) > 2:
        url ="https://www.google.co.jp/search?q=" + keyWord
        refreshBrowse(url)
        if (mode!='onlySearch'):
            rtUrl = checkGoogleHP(mode)
        else:
            rtUrl = ''
    return rtUrl


# In[64]:


def googleSearchGetComName(comName):
    comName=comName.replace("\n","").replace('"','')
    keyWord = comName 
    if len (keyWord ) > 2:
        url ="https://www.google.co.jp/search?q=" + keyWord
        refreshBrowse(url)
        rtUrl = checkGoogleComName(comName)
        rtUrl = rtUrl.replace('トップページ','')
    if comName.lstrip()[0:2]=="株式" and rtUrl.find("株式") == -1 : rtUrl = "株式会社 " + rtUrl
    if comName.rstrip()[-4:]=="株式会社" and rtUrl.find("株式") == -1 : rtUrl =  rtUrl + " 株式会社"
    if comName.lstrip()[0:2]=="有限" and rtUrl.find("有限") == -1 : rtUrl = "有限会社 " + rtUrl
    if comName.rstrip()[-4:]=="有限会社" and rtUrl.find("有限") == -1 : rtUrl =  rtUrl + " 有限会社"

    return rtUrl


# In[26]:


def googleSearchAddress(comName):
    comName=comName.replace("\n","").replace('"','')
    keyWord = comName.replace("...","") + ' 本社 住所'
    if len (keyWord ) > 2:
        url ="https://www.google.co.jp/search?q=" + keyWord
        refreshBrowse(url)
        rtUrl = checkGoogleAdd()
        
    keyWord = comName + ' 本社 所在地'    
    if len (keyWord ) > 2:
        url ="htts://www.google.co.jp/search?q=" + keyWord
        refreshBrowse(url)
        rtUrl = checkGoogleAdd()
    
    return rtUrl


# In[55]:


def googleSearchWithHP(HP):
    rtUrl=''
    comName=''
    HP=HP.replace("\n","").replace('"','')
    keyWord = HP 
    if len (keyWord ) > 2:
        url ="https://www.google.co.jp/search?q=" + keyWord
        refreshBrowse(url)
        if find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div[1]/div/div/span/a/h3'):
            comName = driver.find_elements(By.XPATH, '//*[@id="rso"]/div[1]/div/div/div[1]/div/div/span/a/h3')[0].get_attribute('innerHTML')
    return comName


# In[6]:


def googleSearchTel(comName):
    keyWord = comName + " " + "電話番号"
    url ="https://www.google.co.jp/search?q=" + keyWord
    refreshBrowse(url)

    
    tel=''
    for i in driver.find_elements(By.TAG_NAME, "TD"):
        if len(i.get_attribute('innerHTML')) > 3:
            tel =getTel(i.get_attribute('innerHTML'))
            if tel!='':
                if gl_address=='':
                    break
                else:
                    if checkTelAdd(gl_address,tel) == 1:
                        break
                    
    if tel =='':
        for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[*]/div/div/div[*]/div/span'):
            if len(i.get_attribute('innerHTML')) > 3:
                tel =getTel(i.get_attribute('innerHTML'))
                if tel!='':
                    if gl_address=='':
                        break
                    else:
                        if checkTelAdd(gl_address,tel) == 1:
                            break
                    
    if tel =='':
        for i in driver.find_elements(By.XPATH, '//*[@id="rso"]/div[*]/div/div/div[*]/div'):
            if len(i.get_attribute('innerHTML')) > 3:
                tel =getTel(i.get_attribute('innerHTML'))
                if tel!='':
                    if gl_address=='':
                        break
                    else:
                        if checkTelAdd(gl_address,tel) == 1:
                            break
    if tel =='':
        for i in driver.find_elements(By.TAG_NAME, "SPAN"):
            if len(i.get_attribute('innerHTML')) > 3:
                tel =getTel(i.get_attribute('innerHTML'))
                if tel!='':
                    if gl_address=='':
                        break
                    else:
                        if checkTelAdd(gl_address,tel) == 1:
                            break
    return tel


# In[87]:


def getOrgData(xurl):
    cnt=0
    import csv
    KcompanyName = ''
    Kaddress = ''
    Kbusiness = ''
    #with open('C:\\Users\\taejolee\\Source\\SubJ\\companyList\\result.csv', newline='',encoding='utf-8') as csvfile:
    if len(xurl ) < 5 : 
        return KcompanyName,Kaddress,Kbusiness
    try:
        driver.get(xurl )
    except:
        return  KcompanyName,Kaddress,Kbusiness
    time.sleep(3)
    if driver.find_elements(By.XPATH,'/html/body/div[1]/div/div/p'):
        findData = driver.find_elements(By.XPATH,'/html/body/div[1]/div/div/p')[0].get_attribute('innerHTML')
        if findData.find('お探しの求人は求人ボックスでの掲載が終了したか') == -1:
            for i in driver.find_elements(By.TAG_NAME,'h2'):
                if i.get_attribute('CLASS') == 'p-detail_title':
                    KcompanyName=i.get_attribute('innerHTML')
                    if KcompanyName.find('仕事内容') == -1 and KcompanyName.find('応募資格') == -1  and KcompanyName.find('募集背景') == -1  and KcompanyName.find('経験・資格') == -1 and KcompanyName.find('職務概要') == -1:
                        KcompanyName=i.get_attribute('innerHTML')
                        subElement = i
                        break

            for j in  driver.find_elements(By.TAG_NAME,'div'):
                if j.get_attribute('CLASS') == 'c-panel p-detail_table_panel':
                    Kaddress=j.get_attribute('outerHTML')
                    if Kaddress.find('住所') > -1 or Kaddress.find('勤務地') > -1 :
                        subElement = j
                        for i in subElement.find_elements(By.TAG_NAME,'p'):
                            if i.get_attribute('CLASS') == 'p-detail_line':
                                if findAddStr(i.get_attribute('innerHTML')) != '':
                                    Kaddress=getAdd(Kaddress)
                                    #Kaddress=modifyAdd(Kaddress)
                                    break
                        break
            if len(Kaddress) < 3:
                for j in  driver.find_elements(By.TAG_NAME,'p'):
                    if j.get_attribute('CLASS') == 'p-detail_line':
                        Kaddress=j.get_attribute('innerHTML')
                        if Kaddress.find('住所') > -1 or Kaddress.find('勤務地') > -1 :
                            Kaddress = getAdd(Kaddress)
                            #Kaddress=modifyAdd(Kaddress)
                            break

#                    if driver.find_elements(By.XPATH,'/html/body/div[1]/div[1]/article/div/div[2]/section[4]/div/div/div/h2'):
#                        KcompanyName = driver.find_elements(By.XPATH,'/html/body/div[1]/div[1]/article/div/div[2]/section[4]/div/div/div/h2')[0].get_attribute('innerHTML')
            for j in  driver.find_elements(By.TAG_NAME,'div'):
                if j.get_attribute('CLASS') == 's-more_element':
                    Kbusiness=j.get_attribute('outerHTML')
                    if Kbusiness.find('事業内容') > -1:
                        subElement = j
                        for i in subElement.find_elements(By.TAG_NAME,'p'):
                            if i.get_attribute('CLASS') == 'p-detail_line':
                                Kbusiness = removeTagInfo(i.get_attribute('innerHTML'))
                                break
                        if Kbusiness == '':
                            if Kbusiness.find('事業形態') > -1:
                                subElement = j
                                for i in subElement.find_elements(By.TAG_NAME,'p'):
                                    if i.get_attribute('CLASS') == 'p-detail_line':
                                        Kbusiness = removeTagInfo(i.get_attribute('innerHTML'))
                                        break
                        break
    Kbusiness=removeTagInfo(Kbusiness)
    Kbusiness=Kbusiness.lstrip().rstrip()                        

    return KcompanyName,Kaddress,Kbusiness


# In[58]:


def diffPercentage(str1, str2):
    s = SequenceMatcher(None, str1, str2)
    return s.ratio()


# In[59]:


#driver = CreateWebBrowser()
#refreshBrowse('https://www.google.co.jp/search?q=%E3%83%8A%E3%83%96%E3%83%86%E3%82%B9%E3%82%B3%E3%82%B5%E3%83%BC%E3%83%93%E3%82%B9%E6%A0%AA%E5%BC%8F%E4%BC%9A%E7%A4%BE%E3%80%80%E5%BE%93%E6%A5%AD%E5%93%A1&sca_esv=602075711&ei=ecS1ZZXRJb6P2roP4oKM-Ao&ved=0ahUKEwjV8eLpjP-DAxW-h1YBHWIBA68Q4dUDCBA&uact=5&oq=%E3%83%8A%E3%83%96%E3%83%86%E3%82%B9%E3%82%B3%E3%82%B5%E3%83%BC%E3%83%93%E3%82%B9%E6%A0%AA%E5%BC%8F%E4%BC%9A%E7%A4%BE%E3%80%80%E5%BE%93%E6%A5%AD%E5%93%A1&gs_lp=Egxnd3Mtd2l6LXNlcnAiM-ODiuODluODhuOCueOCs-OCteODvOODk-OCueagquW8j-S8muekvuOAgOW-k-alreWToTIGEAAYHhgPSIoGUMwEWMwEcAF4AZABAJgBWaABWaoBATG4AQPIAQD4AQHCAgoQABhHGNYEGLAD4gMEGAAgQYgGAZAGCQ&sclient=gws-wiz-serp')


# In[6]:


def checkOverView(companyName, hp):
    global gl_Money
    global gl_president
    global gl_empNum
    global gl_address
    global gl_business
    global gl_tel
    global gl_buyFlg
    global gl_HP
    global driver
    url=''
    tempUrl=''
    if type(hp) != str : return ""
    hp=str(hp)
    cmpHP=hp.replace('www','').replace('https://','').replace('http://','')
    googleSearchCH(companyName + ' 概要','onlySearch')
    for i in driver.find_elements(By.TAG_NAME, "div"):
        try:
            if i.get_attribute('CLASS') :
                if i.get_attribute('CLASS').find('kb0PBd cvP2Ce jGGQ5e')>-1:
                    rt=i.get_attribute('outerHTML')
                    if (rt.find('概要') > -1 or rt.find('会社案内') > -1  or rt.find('会社情報') > -1 or rt.find('企業情報') > -1 or rt.upper().find('COMPANY') > -1 ) and rt.find(cmpHP) > -1 :
                        for j in i.find_elements(By.TAG_NAME, "a"):
                            if exhibitURLCheck(j.get_attribute('href')) != '':
                                url =j.get_attribute('href')
                                break
                        break
        except:
            pass    
    if url=='' or url.find(cmpHP) == -1:   
        googleSearchCH(companyName + ' ' + hp+' 概要','onlySearch')
        for i in driver.find_elements(By.TAG_NAME, "div"):
            try:
                if i.get_attribute('CLASS') :
                    if i.get_attribute('CLASS').find('kb0PBd cvP2Ce jGGQ5e')>-1:
                        rt=i.get_attribute('outerHTML')
                        if (rt.find('概要') > -1 or rt.find('会社案内') > -1 or rt.find('会社情報') > -1 or rt.find('企業情報') > -1 or rt.upper().find('COMPANY') > -1) and rt.find(cmpHP) > -1 :
                            for j in i.find_elements(By.TAG_NAME, "a"):
                                if exhibitURLCheck(j.get_attribute('href')) != '':
                                    url =j.get_attribute('href')
                                    break
                            break
            except:
                pass    
                
    if url=='' and gl_HP != "":
        refreshBrowse(gl_HP)
        url = companyInfo()

    if url !='' :
        if gl_HP == '': 
            tempUrl=url[:url.find("/",9)]
            gl_HP=tempUrl
            
        #print(url)
        driver=refreshBrowse(url)
    return url
        
            
        #print('HP OK')
        #print('会社名 OK')
        #source = driver.page_source
        #print(gl_tel + " " + str(source.find(gl_tel) ))
        #print(gl_address + " " + str(source.find(gl_address) ))
        #print(gl_Money + " " + str(source.find(gl_Money) ))
        #print(gl_business + " " + str(source.find(gl_business) ))
        #print(gl_empNum + " " + str(source.find(gl_empNum) ))
        
        #if len(gl_tel) > 0 and  source.find(gl_tel) > -1 : print('電話番号OK')
        #if len(gl_address) > 0 and source.find(gl_address) > -1 : print('住所OK')
        #if len(gl_Money) > 0 and source.find(gl_Money) > -1 : print('住所OK')
        #if len(gl_business) > 0 and source.find(gl_business) > -1 : print('事業内容OK')
        #if len(gl_empNum) > 0 and source.find(gl_empNum) > -1 : print('従業員数OK')

            


# In[2]:


def exhibitURLCheck(url):
    rt=url
    if rt==None:return ''
    exhibitList = ['jbplt.jp','tsukulink.net','recyclehub.jp','https://xn','reform-master.net','doda.jp','kenzai-navi.com','itp.ne.jp','a6l.jp','baitoru.com','goo-net.com','homemate-research-drugstore.com','navitime.co.jp','mynavi.jp','twitter.com','twitter','tabelog.com','yahoo.co.jp','el.e-shops.jp','mtke-job.jp','paypay','biz.ne.jp','ats.joboplite.jp','mapion.co','.pdf','youtube','rakuten','epark.jp','en-gage.net','work-canvas.com','biz-maps','newscast.jp','kotobank.jp','wikipedia.org','1cs.jp','baseconnect.in','s-agent.jp','pcareer.m3.com','www.w3.org','salesnow.jp','en-hyouban.com','airjobtour.net','prtimes.jp','shizumatch.jp','jp.stanby.com','recruit','job.rikunabi.com','github.com','nstagram.com','job-gear.net','senken.co.jp','nikkei.com','arc-navi','doda.co.jp','indeed.com','koyou.pref.shizuoka.jp','sumo.jp','homes.co.jp','google.co','next.rikunabi','townwork.net','doraever.jp','sharefull.com','hatalike.jp','jobtalk.jp','nucoxd9y6','b-mall.ne','info.gbiz','grffer','careerindex','irbank','job.goo','job-net','houjin.jp','cnavi.g-search','e-aidem']
    for i in exhibitList:
        if url.find(i) > -1 :
            rt= ''
            break
    return rt


# In[45]:


def contactPageValidCheck(hp, contact):
    rt=-1
    if hp == '' or contact == '': 
        rt=-1
        return rt
    cmphp = hp.replace('https://','').replace('http://','').replace('www','')
    if contact.find(cmphp) > -1:
        rt=1
    return rt        


# In[1]:


def getTextFromImage(imageFilePath):
    text=""
    pytesseract.pytesseract.tesseract_cmd = r'C:\Program Files\Tesseract-OCR\tesseract.exe'
    # 이미지 파일 열기
    image = Image.open(imageFilePath)
    image_cv = cv2.imread(imageFilePath)
    
    gray = cv2.cvtColor(image_cv, cv2.COLOR_BGR2GRAY)
    thresh = cv2.threshold(gray, 0, 255, cv2.THRESH_BINARY_INV + cv2.THRESH_OTSU)[1]
    
    text = pytesseract.image_to_string(image, lang='eng')
    
    # 추출된 텍스트 출력
    print(text)
    return text


# In[10]:


def is_port_in_use(port):
    import socket
    # ソケットを作成してポートをスキャン
    with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as s:
        return s.connect_ex(('localhost', port)) == 0
        


# In[13]:


def useBrowser(url, port="9993", driver=None):
    if url == "": 
        print("URLが正しくないです。")
        return None
    
    try:
        if is_port_in_use(int(port)) == False:
            command = [
                "C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe",
                "--remote-debugging-port=" + port,
                "--user-data-dir=C:\\tools\\SRManager\\temp\\" + port
            ]
            # コマンドを実行
            process = subprocess.Popen(command)
            time.sleep(5)
        
        if driver is None:
            options = webdriver.ChromeOptions()
            options.add_experimental_option("debuggerAddress", "127.0.0.1:" + port)
            options.add_argument("--user-agent=Your-New-User-Agent-Here")
            driver = webdriver.Chrome(options=options)
    except:
        print("ブラウザの認識が正常にできませんでした。")
        return None
    try:
        driver.get(url)
        return driver
    except:
        return -1





